TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_usb.h
//###########################################################################
//
// FILE:    hw_usb.h
//
// TITLE:   Definitions for the USB registers.
//
//###########################################################################
// 
// C2000Ware v26.01.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_USB_H
#define HW_USB_H

//*****************************************************************************
// The following are defines for the Univeral Serial Bus register offsets.
//*****************************************************************************
#define USB_O_FADDR                  0x00000000 // USB Device Functional
                                                // Address
#define USB_O_POWER                  0x00000001 // USB Power
#define USB_O_TXIS                   0x00000002 // USB Transmit Interrupt
                                                // Status
#define USB_O_RXIS                   0x00000004 // USB Receive Interrupt Status
#define USB_O_TXIE                   0x00000006 // USB Transmit Interrupt
                                                // Enable
#define USB_O_RXIE                   0x00000008 // USB Receive Interrupt Enable
#define USB_O_IS                     0x0000000A // USB General Interrupt Status
#define USB_O_IE                     0x0000000B // USB Interrupt Enable
#define USB_O_FRAME                  0x0000000C // USB Frame Value
#define USB_O_EPIDX                  0x0000000E // USB Endpoint Index
#define USB_O_TEST                   0x0000000F // USB Test Mode
#define USB_O_FIFO0                  0x00000020 // USB FIFO Endpoint 0
#define USB_O_FIFO1                  0x00000024 // USB FIFO Endpoint 1
#define USB_O_FIFO2                  0x00000028 // USB FIFO Endpoint 2
#define USB_O_FIFO3                  0x0000002C // USB FIFO Endpoint 3
#define USB_O_FIFO4                  0x00000030 // USB FIFO Endpoint 4
#define USB_O_FIFO5                  0x00000034 // USB FIFO Endpoint 5
#define USB_O_FIFO6                  0x00000038 // USB FIFO Endpoint 6
#define USB_O_FIFO7                  0x0000003C // USB FIFO Endpoint 7
#define USB_O_FIFO8                  0x00000040 // USB FIFO Endpoint 8
#define USB_O_FIFO9                  0x00000044 // USB FIFO Endpoint 9
#define USB_O_FIFO10                 0x00000048 // USB FIFO Endpoint 10
#define USB_O_FIFO11                 0x0000004C // USB FIFO Endpoint 11
#define USB_O_FIFO12                 0x00000050 // USB FIFO Endpoint 12
#define USB_O_FIFO13                 0x00000054 // USB FIFO Endpoint 13
#define USB_O_FIFO14                 0x00000058 // USB FIFO Endpoint 14
#define USB_O_FIFO15                 0x0000005C // USB FIFO Endpoint 15
#define USB_O_DEVCTL                 0x00000060 // USB Device Control
#define USB_O_TXFIFOSZ               0x00000062 // USB Transmit Dynamic FIFO
                                                // Sizing
#define USB_O_RXFIFOSZ               0x00000063 // USB Receive Dynamic FIFO
                                                // Sizing
#define USB_O_TXFIFOADD              0x00000064 // USB Transmit FIFO Start
                                                // Address
#define USB_O_RXFIFOADD              0x00000066 // USB Receive FIFO Start
                                                // Address
#define USB_O_CONTIM                 0x0000007A // USB Connect Timing
#define USB_O_VPLEN                  0x0000007B // USB OTG VBUS Pulse Timing
#define USB_O_FSEOF                  0x0000007D // USB Full-Speed Last
                                                // Transaction to End of Frame
                                                // Timing
#define USB_O_LSEOF                  0x0000007E // USB Low-Speed Last
                                                // Transaction to End of Frame
                                                // Timing
#define USB_O_TXFUNCADDR0            0x00000080 // USB Transmit Functional
                                                // Address Endpoint 0
#define USB_O_TXHUBADDR0             0x00000082 // USB Transmit Hub Address
                                                // Endpoint 0
#define USB_O_TXHUBPORT0             0x00000083 // USB Transmit Hub Port
                                                // Endpoint 0
#define USB_O_TXFUNCADDR1            0x00000088 // USB Transmit Functional
                                                // Address Endpoint 1
#define USB_O_TXHUBADDR1             0x0000008A // USB Transmit Hub Address
                                                // Endpoint 1
#define USB_O_TXHUBPORT1             0x0000008B // USB Transmit Hub Port
                                                // Endpoint 1
#define USB_O_RXFUNCADDR1            0x0000008C // USB Receive Functional
                                                // Address Endpoint 1
#define USB_O_RXHUBADDR1             0x0000008E // USB Receive Hub Address
                                                // Endpoint 1
#define USB_O_RXHUBPORT1             0x0000008F // USB Receive Hub Port
                                                // Endpoint 1
#define USB_O_TXFUNCADDR2            0x00000090 // USB Transmit Functional
                                                // Address Endpoint 2
#define USB_O_TXHUBADDR2             0x00000092 // USB Transmit Hub Address
                                                // Endpoint 2
#define USB_O_TXHUBPORT2             0x00000093 // USB Transmit Hub Port
                                                // Endpoint 2
#define USB_O_RXFUNCADDR2            0x00000094 // USB Receive Functional
                                                // Address Endpoint 2
#define USB_O_RXHUBADDR2             0x00000096 // USB Receive Hub Address
                                                // Endpoint 2
#define USB_O_RXHUBPORT2             0x00000097 // USB Receive Hub Port
                                                // Endpoint 2
#define USB_O_TXFUNCADDR3            0x00000098 // USB Transmit Functional
                                                // Address Endpoint 3
#define USB_O_TXHUBADDR3             0x0000009A // USB Transmit Hub Address
                                                // Endpoint 3
#define USB_O_TXHUBPORT3             0x0000009B // USB Transmit Hub Port
                                                // Endpoint 3
#define USB_O_RXFUNCADDR3            0x0000009C // USB Receive Functional
                                                // Address Endpoint 3
#define USB_O_RXHUBADDR3             0x0000009E // USB Receive Hub Address
                                                // Endpoint 3
#define USB_O_RXHUBPORT3             0x0000009F // USB Receive Hub Port
                                                // Endpoint 3
#define USB_O_TXFUNCADDR4            0x000000A0 // USB Transmit Functional
                                                // Address Endpoint 4
#define USB_O_TXHUBADDR4             0x000000A2 // USB Transmit Hub Address
                                                // Endpoint 4
#define USB_O_TXHUBPORT4             0x000000A3 // USB Transmit Hub Port
                                                // Endpoint 4
#define USB_O_RXFUNCADDR4            0x000000A4 // USB Receive Functional
                                                // Address Endpoint 4
#define USB_O_RXHUBADDR4             0x000000A6 // USB Receive Hub Address
                                                // Endpoint 4
#define USB_O_RXHUBPORT4             0x000000A7 // USB Receive Hub Port
                                                // Endpoint 4
#define USB_O_TXFUNCADDR5            0x000000A8 // USB Transmit Functional
                                                // Address Endpoint 5
#define USB_O_TXHUBADDR5             0x000000AA // USB Transmit Hub Address
                                                // Endpoint 5
#define USB_O_TXHUBPORT5             0x000000AB // USB Transmit Hub Port
                                                // Endpoint 5
#define USB_O_RXFUNCADDR5            0x000000AC // USB Receive Functional
                                                // Address Endpoint 5
#define USB_O_RXHUBADDR5             0x000000AE // USB Receive Hub Address
                                                // Endpoint 5
#define USB_O_RXHUBPORT5             0x000000AF // USB Receive Hub Port
                                                // Endpoint 5
#define USB_O_TXFUNCADDR6            0x000000B0 // USB Transmit Functional
                                                // Address Endpoint 6
#define USB_O_TXHUBADDR6             0x000000B2 // USB Transmit Hub Address
                                                // Endpoint 6
#define USB_O_TXHUBPORT6             0x000000B3 // USB Transmit Hub Port
                                                // Endpoint 6
#define USB_O_RXFUNCADDR6            0x000000B4 // USB Receive Functional
                                                // Address Endpoint 6
#define USB_O_RXHUBADDR6             0x000000B6 // USB Receive Hub Address
                                                // Endpoint 6
#define USB_O_RXHUBPORT6             0x000000B7 // USB Receive Hub Port
                                                // Endpoint 6
#define USB_O_TXFUNCADDR7            0x000000B8 // USB Transmit Functional
                                                // Address Endpoint 7
#define USB_O_TXHUBADDR7             0x000000BA // USB Transmit Hub Address
                                                // Endpoint 7
#define USB_O_TXHUBPORT7             0x000000BB // USB Transmit Hub Port
                                                // Endpoint 7
#define USB_O_RXFUNCADDR7            0x000000BC // USB Receive Functional
                                                // Address Endpoint 7
#define USB_O_RXHUBADDR7             0x000000BE // USB Receive Hub Address
                                                // Endpoint 7
#define USB_O_RXHUBPORT7             0x000000BF // USB Receive Hub Port
                                                // Endpoint 7
#define USB_O_TXFUNCADDR8            0x000000C0 // USB Transmit Functional
                                                // Address Endpoint 8
#define USB_O_TXHUBADDR8             0x000000C2 // USB Transmit Hub Address
                                                // Endpoint 8
#define USB_O_TXHUBPORT8             0x000000C3 // USB Transmit Hub Port
                                                // Endpoint 8
#define USB_O_RXFUNCADDR8            0x000000C4 // USB Receive Functional
                                                // Address Endpoint 8
#define USB_O_RXHUBADDR8             0x000000C6 // USB Receive Hub Address
                                                // Endpoint 8
#define USB_O_RXHUBPORT8             0x000000C7 // USB Receive Hub Port
                                                // Endpoint 8
#define USB_O_TXFUNCADDR9            0x000000C8 // USB Transmit Functional
                                                // Address Endpoint 9
#define USB_O_TXHUBADDR9             0x000000CA // USB Transmit Hub Address
                                                // Endpoint 9
#define USB_O_TXHUBPORT9             0x000000CB // USB Transmit Hub Port
                                                // Endpoint 9
#define USB_O_RXFUNCADDR9            0x000000CC // USB Receive Functional
                                                // Address Endpoint 9
#define USB_O_RXHUBADDR9             0x000000CE // USB Receive Hub Address
                                                // Endpoint 9
#define USB_O_RXHUBPORT9             0x000000CF // USB Receive Hub Port
                                                // Endpoint 9
#define USB_O_TXFUNCADDR10           0x000000D0 // USB Transmit Functional
                                                // Address Endpoint 10
#define USB_O_TXHUBADDR10            0x000000D2 // USB Transmit Hub Address
                                                // Endpoint 10
#define USB_O_TXHUBPORT10            0x000000D3 // USB Transmit Hub Port
                                                // Endpoint 10
#define USB_O_RXFUNCADDR10           0x000000D4 // USB Receive Functional
                                                // Address Endpoint 10
#define USB_O_RXHUBADDR10            0x000000D6 // USB Receive Hub Address
                                                // Endpoint 10
#define USB_O_RXHUBPORT10            0x000000D7 // USB Receive Hub Port
                                                // Endpoint 10
#define USB_O_TXFUNCADDR11           0x000000D8 // USB Transmit Functional
                                                // Address Endpoint 11
#define USB_O_TXHUBADDR11            0x000000DA // USB Transmit Hub Address
                                                // Endpoint 11
#define USB_O_TXHUBPORT11            0x000000DB // USB Transmit Hub Port
                                                // Endpoint 11
#define USB_O_RXFUNCADDR11           0x000000DC // USB Receive Functional
                                                // Address Endpoint 11
#define USB_O_RXHUBADDR11            0x000000DE // USB Receive Hub Address
                                                // Endpoint 11
#define USB_O_RXHUBPORT11            0x000000DF // USB Receive Hub Port
                                                // Endpoint 11
#define USB_O_TXFUNCADDR12           0x000000E0 // USB Transmit Functional
                                                // Address Endpoint 12
#define USB_O_TXHUBADDR12            0x000000E2 // USB Transmit Hub Address
                                                // Endpoint 12
#define USB_O_TXHUBPORT12            0x000000E3 // USB Transmit Hub Port
                                                // Endpoint 12
#define USB_O_RXFUNCADDR12           0x000000E4 // USB Receive Functional
                                                // Address Endpoint 12
#define USB_O_RXHUBADDR12            0x000000E6 // USB Receive Hub Address
                                                // Endpoint 12
#define USB_O_RXHUBPORT12            0x000000E7 // USB Receive Hub Port
                                                // Endpoint 12
#define USB_O_TXFUNCADDR13           0x000000E8 // USB Transmit Functional
                                                // Address Endpoint 13
#define USB_O_TXHUBADDR13            0x000000EA // USB Transmit Hub Address
                                                // Endpoint 13
#define USB_O_TXHUBPORT13            0x000000EB // USB Transmit Hub Port
                                                // Endpoint 13
#define USB_O_RXFUNCADDR13           0x000000EC // USB Receive Functional
                                                // Address Endpoint 13
#define USB_O_RXHUBADDR13            0x000000EE // USB Receive Hub Address
                                                // Endpoint 13
#define USB_O_RXHUBPORT13            0x000000EF // USB Receive Hub Port
                                                // Endpoint 13
#define USB_O_TXFUNCADDR14           0x000000F0 // USB Transmit Functional
                                                // Address Endpoint 14
#define USB_O_TXHUBADDR14            0x000000F2 // USB Transmit Hub Address
                                                // Endpoint 14
#define USB_O_TXHUBPORT14            0x000000F3 // USB Transmit Hub Port
                                                // Endpoint 14
#define USB_O_RXFUNCADDR14           0x000000F4 // USB Receive Functional
                                                // Address Endpoint 14
#define USB_O_RXHUBADDR14            0x000000F6 // USB Receive Hub Address
                                                // Endpoint 14
#define USB_O_RXHUBPORT14            0x000000F7 // USB Receive Hub Port
                                                // Endpoint 14
#define USB_O_TXFUNCADDR15           0x000000F8 // USB Transmit Functional
                                                // Address Endpoint 15
#define USB_O_TXHUBADDR15            0x000000FA // USB Transmit Hub Address
                                                // Endpoint 15
#define USB_O_TXHUBPORT15            0x000000FB // USB Transmit Hub Port
                                                // Endpoint 15
#define USB_O_RXFUNCADDR15           0x000000FC // USB Receive Functional
                                                // Address Endpoint 15
#define USB_O_RXHUBADDR15            0x000000FE // USB Receive Hub Address
                                                // Endpoint 15
#define USB_O_RXHUBPORT15            0x000000FF // USB Receive Hub Port
                                                // Endpoint 15
#define USB_O_CSRL0                  0x00000102 // USB Control and Status
                                                // Endpoint 0 Low
#define USB_O_CSRH0                  0x00000103 // USB Control and Status
                                                // Endpoint 0 High
#define USB_O_COUNT0                 0x00000108 // USB Receive Byte Count
                                                // Endpoint 0
#define USB_O_TYPE0                  0x0000010A // USB Type Endpoint 0
#define USB_O_NAKLMT                 0x0000010B // USB NAK Limit
#define USB_O_TXMAXP1                0x00000110 // USB Maximum Transmit Data
                                                // Endpoint 1
#define USB_O_TXCSRL1                0x00000112 // USB Transmit Control and
                                                // Status Endpoint 1 Low
#define USB_O_TXCSRH1                0x00000113 // USB Transmit Control and
                                                // Status Endpoint 1 High
#define USB_O_RXMAXP1                0x00000114 // USB Maximum Receive Data
                                                // Endpoint 1
#define USB_O_RXCSRL1                0x00000116 // USB Receive Control and
                                                // Status Endpoint 1 Low
#define USB_O_RXCSRH1                0x00000117 // USB Receive Control and
                                                // Status Endpoint 1 High
#define USB_O_RXCOUNT1               0x00000118 // USB Receive Byte Count
                                                // Endpoint 1
#define USB_O_TXTYPE1                0x0000011A // USB Host Transmit Configure
                                                // Type Endpoint 1
#define USB_O_TXINTERVAL1            0x0000011B // USB Host Transmit Interval
                                                // Endpoint 1
#define USB_O_RXTYPE1                0x0000011C // USB Host Configure Receive
                                                // Type Endpoint 1
#define USB_O_RXINTERVAL1            0x0000011D // USB Host Receive Polling
                                                // Interval Endpoint 1
#define USB_O_TXMAXP2                0x00000120 // USB Maximum Transmit Data
                                                // Endpoint 2
#define USB_O_TXCSRL2                0x00000122 // USB Transmit Control and
                                                // Status Endpoint 2 Low
#define USB_O_TXCSRH2                0x00000123 // USB Transmit Control and
                                                // Status Endpoint 2 High
#define USB_O_RXMAXP2                0x00000124 // USB Maximum Receive Data
                                                // Endpoint 2
#define USB_O_RXCSRL2                0x00000126 // USB Receive Control and
                                                // Status Endpoint 2 Low
#define USB_O_RXCSRH2                0x00000127 // USB Receive Control and
                                                // Status Endpoint 2 High
#define USB_O_RXCOUNT2               0x00000128 // USB Receive Byte Count
                                                // Endpoint 2
#define USB_O_TXTYPE2                0x0000012A // USB Host Transmit Configure
                                                // Type Endpoint 2
#define USB_O_TXINTERVAL2            0x0000012B // USB Host Transmit Interval
                                                // Endpoint 2
#define USB_O_RXTYPE2                0x0000012C // USB Host Configure Receive
                                                // Type Endpoint 2
#define USB_O_RXINTERVAL2            0x0000012D // USB Host Receive Polling
                                                // Interval Endpoint 2
#define USB_O_TXMAXP3                0x00000130 // USB Maximum Transmit Data
                                                // Endpoint 3
#define USB_O_TXCSRL3                0x00000132 // USB Transmit Control and
                                                // Status Endpoint 3 Low
#define USB_O_TXCSRH3                0x00000133 // USB Transmit Control and
                                                // Status Endpoint 3 High
#define USB_O_RXMAXP3                0x00000134 // USB Maximum Receive Data
                                                // Endpoint 3
#define USB_O_RXCSRL3                0x00000136 // USB Receive Control and
                                                // Status Endpoint 3 Low
#define USB_O_RXCSRH3                0x00000137 // USB Receive Control and
                                                // Status Endpoint 3 High
#define USB_O_RXCOUNT3               0x00000138 // USB Receive Byte Count
                                                // Endpoint 3
#define USB_O_TXTYPE3                0x0000013A // USB Host Transmit Configure
                                                // Type Endpoint 3
#define USB_O_TXINTERVAL3            0x0000013B // USB Host Transmit Interval
                                                // Endpoint 3
#define USB_O_RXTYPE3                0x0000013C // USB Host Configure Receive
                                                // Type Endpoint 3
#define USB_O_RXINTERVAL3            0x0000013D // USB Host Receive Polling
                                                // Interval Endpoint 3
#define USB_O_TXMAXP4                0x00000140 // USB Maximum Transmit Data
                                                // Endpoint 4
#define USB_O_TXCSRL4                0x00000142 // USB Transmit Control and
