TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_usb.h
                                                // Status Endpoint 4 Low
#define USB_O_TXCSRH4                0x00000143 // USB Transmit Control and
                                                // Status Endpoint 4 High
#define USB_O_RXMAXP4                0x00000144 // USB Maximum Receive Data
                                                // Endpoint 4
#define USB_O_RXCSRL4                0x00000146 // USB Receive Control and
                                                // Status Endpoint 4 Low
#define USB_O_RXCSRH4                0x00000147 // USB Receive Control and
                                                // Status Endpoint 4 High
#define USB_O_RXCOUNT4               0x00000148 // USB Receive Byte Count
                                                // Endpoint 4
#define USB_O_TXTYPE4                0x0000014A // USB Host Transmit Configure
                                                // Type Endpoint 4
#define USB_O_TXINTERVAL4            0x0000014B // USB Host Transmit Interval
                                                // Endpoint 4
#define USB_O_RXTYPE4                0x0000014C // USB Host Configure Receive
                                                // Type Endpoint 4
#define USB_O_RXINTERVAL4            0x0000014D // USB Host Receive Polling
                                                // Interval Endpoint 4
#define USB_O_TXMAXP5                0x00000150 // USB Maximum Transmit Data
                                                // Endpoint 5
#define USB_O_TXCSRL5                0x00000152 // USB Transmit Control and
                                                // Status Endpoint 5 Low
#define USB_O_TXCSRH5                0x00000153 // USB Transmit Control and
                                                // Status Endpoint 5 High
#define USB_O_RXMAXP5                0x00000154 // USB Maximum Receive Data
                                                // Endpoint 5
#define USB_O_RXCSRL5                0x00000156 // USB Receive Control and
                                                // Status Endpoint 5 Low
#define USB_O_RXCSRH5                0x00000157 // USB Receive Control and
                                                // Status Endpoint 5 High
#define USB_O_RXCOUNT5               0x00000158 // USB Receive Byte Count
                                                // Endpoint 5
#define USB_O_TXTYPE5                0x0000015A // USB Host Transmit Configure
                                                // Type Endpoint 5
#define USB_O_TXINTERVAL5            0x0000015B // USB Host Transmit Interval
                                                // Endpoint 5
#define USB_O_RXTYPE5                0x0000015C // USB Host Configure Receive
                                                // Type Endpoint 5
#define USB_O_RXINTERVAL5            0x0000015D // USB Host Receive Polling
                                                // Interval Endpoint 5
#define USB_O_TXMAXP6                0x00000160 // USB Maximum Transmit Data
                                                // Endpoint 6
#define USB_O_TXCSRL6                0x00000162 // USB Transmit Control and
                                                // Status Endpoint 6 Low
#define USB_O_TXCSRH6                0x00000163 // USB Transmit Control and
                                                // Status Endpoint 6 High
#define USB_O_RXMAXP6                0x00000164 // USB Maximum Receive Data
                                                // Endpoint 6
#define USB_O_RXCSRL6                0x00000166 // USB Receive Control and
                                                // Status Endpoint 6 Low
#define USB_O_RXCSRH6                0x00000167 // USB Receive Control and
                                                // StatusEndpoint 6 High
#define USB_O_RXCOUNT6               0x00000168 // USB Receive Byte Count
                                                // Endpoint 6
#define USB_O_TXTYPE6                0x0000016A // USB Host Transmit Configure
                                                // Type Endpoint 6
#define USB_O_TXINTERVAL6            0x0000016B // USB Host Transmit Interval
                                                // Endpoint 6
#define USB_O_RXTYPE6                0x0000016C // USB Host Configure Receive
                                                // Type Endpoint 6
#define USB_O_RXINTERVAL6            0x0000016D // USB Host Receive Polling
                                                // Interval Endpoint 6
#define USB_O_TXMAXP7                0x00000170 // USB Maximum Transmit Data
                                                // Endpoint 7
#define USB_O_TXCSRL7                0x00000172 // USB Transmit Control and
                                                // Status Endpoint 7 Low
#define USB_O_TXCSRH7                0x00000173 // USB Transmit Control and
                                                // Status Endpoint 7 High
#define USB_O_RXMAXP7                0x00000174 // USB Maximum Receive Data
                                                // Endpoint 7
#define USB_O_RXCSRL7                0x00000176 // USB Receive Control and
                                                // Status Endpoint 7 Low
#define USB_O_RXCSRH7                0x00000177 // USB Receive Control and
                                                // Status Endpoint 7 High
#define USB_O_RXCOUNT7               0x00000178 // USB Receive Byte Count
                                                // Endpoint 7
#define USB_O_TXTYPE7                0x0000017A // USB Host Transmit Configure
                                                // Type Endpoint 7
#define USB_O_TXINTERVAL7            0x0000017B // USB Host Transmit Interval
                                                // Endpoint 7
#define USB_O_RXTYPE7                0x0000017C // USB Host Configure Receive
                                                // Type Endpoint 7
#define USB_O_RXINTERVAL7            0x0000017D // USB Host Receive Polling
                                                // Interval Endpoint 7
#define USB_O_TXMAXP8                0x00000180 // USB Maximum Transmit Data
                                                // Endpoint 8
#define USB_O_TXCSRL8                0x00000182 // USB Transmit Control and
                                                // Status Endpoint 8 Low
#define USB_O_TXCSRH8                0x00000183 // USB Transmit Control and
                                                // Status Endpoint 8 High
#define USB_O_RXMAXP8                0x00000184 // USB Maximum Receive Data
                                                // Endpoint 8
#define USB_O_RXCSRL8                0x00000186 // USB Receive Control and
                                                // Status Endpoint 8 Low
#define USB_O_RXCSRH8                0x00000187 // USB Receive Control and
                                                // Status Endpoint 8 High
#define USB_O_RXCOUNT8               0x00000188 // USB Receive Byte Count
                                                // Endpoint 8
#define USB_O_TXTYPE8                0x0000018A // USB Host Transmit Configure
                                                // Type Endpoint 8
#define USB_O_TXINTERVAL8            0x0000018B // USB Host Transmit Interval
                                                // Endpoint 8
#define USB_O_RXTYPE8                0x0000018C // USB Host Configure Receive
                                                // Type Endpoint 8
#define USB_O_RXINTERVAL8            0x0000018D // USB Host Receive Polling
                                                // Interval Endpoint 8
#define USB_O_TXMAXP9                0x00000190 // USB Maximum Transmit Data
                                                // Endpoint 9
#define USB_O_TXCSRL9                0x00000192 // USB Transmit Control and
                                                // Status Endpoint 9 Low
#define USB_O_TXCSRH9                0x00000193 // USB Transmit Control and
                                                // Status Endpoint 9 High
#define USB_O_RXMAXP9                0x00000194 // USB Maximum Receive Data
                                                // Endpoint 9
#define USB_O_RXCSRL9                0x00000196 // USB Receive Control and
                                                // Status Endpoint 9 Low
#define USB_O_RXCSRH9                0x00000197 // USB Receive Control and
                                                // Status Endpoint 9 High
#define USB_O_RXCOUNT9               0x00000198 // USB Receive Byte Count
                                                // Endpoint 9
#define USB_O_TXTYPE9                0x0000019A // USB Host Transmit Configure
                                                // Type Endpoint 9
#define USB_O_TXINTERVAL9            0x0000019B // USB Host Transmit Interval
                                                // Endpoint 9
#define USB_O_RXTYPE9                0x0000019C // USB Host Configure Receive
                                                // Type Endpoint 9
#define USB_O_RXINTERVAL9            0x0000019D // USB Host Receive Polling
                                                // Interval Endpoint 9
#define USB_O_TXMAXP10               0x000001A0 // USB Maximum Transmit Data
                                                // Endpoint 10
#define USB_O_TXCSRL10               0x000001A2 // USB Transmit Control and
                                                // Status Endpoint 10 Low
#define USB_O_TXCSRH10               0x000001A3 // USB Transmit Control and
                                                // Status Endpoint 10 High
#define USB_O_RXMAXP10               0x000001A4 // USB Maximum Receive Data
                                                // Endpoint 10
#define USB_O_RXCSRL10               0x000001A6 // USB Receive Control and
                                                // Status Endpoint 10 Low
#define USB_O_RXCSRH10               0x000001A7 // USB Receive Control and
                                                // Status Endpoint 10 High
#define USB_O_RXCOUNT10              0x000001A8 // USB Receive Byte Count
                                                // Endpoint 10
#define USB_O_TXTYPE10               0x000001AA // USB Host Transmit Configure
                                                // Type Endpoint 10
#define USB_O_TXINTERVAL10           0x000001AB // USB Host Transmit Interval
                                                // Endpoint 10
#define USB_O_RXTYPE10               0x000001AC // USB Host Configure Receive
                                                // Type Endpoint 10
#define USB_O_RXINTERVAL10           0x000001AD // USB Host Receive Polling
                                                // Interval Endpoint 10
#define USB_O_TXMAXP11               0x000001B0 // USB Maximum Transmit Data
                                                // Endpoint 11
#define USB_O_TXCSRL11               0x000001B2 // USB Transmit Control and
                                                // Status Endpoint 11 Low
#define USB_O_TXCSRH11               0x000001B3 // USB Transmit Control and
                                                // Status Endpoint 11 High
#define USB_O_RXMAXP11               0x000001B4 // USB Maximum Receive Data
                                                // Endpoint 11
#define USB_O_RXCSRL11               0x000001B6 // USB Receive Control and
                                                // Status Endpoint 11 Low
#define USB_O_RXCSRH11               0x000001B7 // USB Receive Control and
                                                // Status Endpoint 11 High
#define USB_O_RXCOUNT11              0x000001B8 // USB Receive Byte Count
                                                // Endpoint 11
#define USB_O_TXTYPE11               0x000001BA // USB Host Transmit Configure
                                                // Type Endpoint 11
#define USB_O_TXINTERVAL11           0x000001BB // USB Host Transmit Interval
                                                // Endpoint 11
#define USB_O_RXTYPE11               0x000001BC // USB Host Configure Receive
                                                // Type Endpoint 11
#define USB_O_RXINTERVAL11           0x000001BD // USB Host Receive Polling
                                                // Interval Endpoint 11
#define USB_O_TXMAXP12               0x000001C0 // USB Maximum Transmit Data
                                                // Endpoint 12
#define USB_O_TXCSRL12               0x000001C2 // USB Transmit Control and
                                                // Status Endpoint 12 Low
#define USB_O_TXCSRH12               0x000001C3 // USB Transmit Control and
                                                // Status Endpoint 12 High
#define USB_O_RXMAXP12               0x000001C4 // USB Maximum Receive Data
                                                // Endpoint 12
#define USB_O_RXCSRL12               0x000001C6 // USB Receive Control and
                                                // Status Endpoint 12 Low
#define USB_O_RXCSRH12               0x000001C7 // USB Receive Control and
                                                // Status Endpoint 12 High
#define USB_O_RXCOUNT12              0x000001C8 // USB Receive Byte Count
                                                // Endpoint 12
#define USB_O_TXTYPE12               0x000001CA // USB Host Transmit Configure
                                                // Type Endpoint 12
#define USB_O_TXINTERVAL12           0x000001CB // USB Host Transmit Interval
                                                // Endpoint 12
#define USB_O_RXTYPE12               0x000001CC // USB Host Configure Receive
                                                // Type Endpoint 12
#define USB_O_RXINTERVAL12           0x000001CD // USB Host Receive Polling
                                                // Interval Endpoint 12
#define USB_O_TXMAXP13               0x000001D0 // USB Maximum Transmit Data
                                                // Endpoint 13
#define USB_O_TXCSRL13               0x000001D2 // USB Transmit Control and
                                                // Status Endpoint 13 Low
#define USB_O_TXCSRH13               0x000001D3 // USB Transmit Control and
                                                // Status Endpoint 13 High
#define USB_O_RXMAXP13               0x000001D4 // USB Maximum Receive Data
                                                // Endpoint 13
#define USB_O_RXCSRL13               0x000001D6 // USB Receive Control and
                                                // Status Endpoint 13 Low
#define USB_O_RXCSRH13               0x000001D7 // USB Receive Control and
                                                // Status Endpoint 13 High
#define USB_O_RXCOUNT13              0x000001D8 // USB Receive Byte Count
                                                // Endpoint 13
#define USB_O_TXTYPE13               0x000001DA // USB Host Transmit Configure
                                                // Type Endpoint 13
#define USB_O_TXINTERVAL13           0x000001DB // USB Host Transmit Interval
                                                // Endpoint 13
#define USB_O_RXTYPE13               0x000001DC // USB Host Configure Receive
                                                // Type Endpoint 13
#define USB_O_RXINTERVAL13           0x000001DD // USB Host Receive Polling
                                                // Interval Endpoint 13
#define USB_O_TXMAXP14               0x000001E0 // USB Maximum Transmit Data
                                                // Endpoint 14
#define USB_O_TXCSRL14               0x000001E2 // USB Transmit Control and
                                                // Status Endpoint 14 Low
#define USB_O_TXCSRH14               0x000001E3 // USB Transmit Control and
                                                // Status Endpoint 14 High
#define USB_O_RXMAXP14               0x000001E4 // USB Maximum Receive Data
                                                // Endpoint 14
#define USB_O_RXCSRL14               0x000001E6 // USB Receive Control and
                                                // Status Endpoint 14 Low
#define USB_O_RXCSRH14               0x000001E7 // USB Receive Control and
                                                // Status Endpoint 14 High
#define USB_O_RXCOUNT14              0x000001E8 // USB Receive Byte Count
                                                // Endpoint 14
#define USB_O_TXTYPE14               0x000001EA // USB Host Transmit Configure
                                                // Type Endpoint 14
#define USB_O_TXINTERVAL14           0x000001EB // USB Host Transmit Interval
                                                // Endpoint 14
#define USB_O_RXTYPE14               0x000001EC // USB Host Configure Receive
                                                // Type Endpoint 14
#define USB_O_RXINTERVAL14           0x000001ED // USB Host Receive Polling
                                                // Interval Endpoint 14
#define USB_O_TXMAXP15               0x000001F0 // USB Maximum Transmit Data
                                                // Endpoint 15
#define USB_O_TXCSRL15               0x000001F2 // USB Transmit Control and
                                                // Status Endpoint 15 Low
#define USB_O_TXCSRH15               0x000001F3 // USB Transmit Control and
                                                // Status Endpoint 15 High
#define USB_O_RXMAXP15               0x000001F4 // USB Maximum Receive Data
                                                // Endpoint 15
#define USB_O_RXCSRL15               0x000001F6 // USB Receive Control and
                                                // Status Endpoint 15 Low
#define USB_O_RXCSRH15               0x000001F7 // USB Receive Control and
                                                // Status Endpoint 15 High
#define USB_O_RXCOUNT15              0x000001F8 // USB Receive Byte Count
                                                // Endpoint 15
#define USB_O_TXTYPE15               0x000001FA // USB Host Transmit Configure
                                                // Type Endpoint 15
#define USB_O_TXINTERVAL15           0x000001FB // USB Host Transmit Interval
                                                // Endpoint 15
#define USB_O_RXTYPE15               0x000001FC // USB Host Configure Receive
                                                // Type Endpoint 15
#define USB_O_RXINTERVAL15           0x000001FD // USB Host Receive Polling
                                                // Interval Endpoint 15
#define USB_O_RQPKTCOUNT1            0x00000304 // USB Request Packet Count in
                                                // Block Transfer Endpoint 1
#define USB_O_RQPKTCOUNT2            0x00000308 // USB Request Packet Count in
                                                // Block Transfer Endpoint 2
#define USB_O_RQPKTCOUNT3            0x0000030C // USB Request Packet Count in
                                                // Block Transfer Endpoint 3
#define USB_O_RQPKTCOUNT4            0x00000310 // USB Request Packet Count in
                                                // Block Transfer Endpoint 4
#define USB_O_RQPKTCOUNT5            0x00000314 // USB Request Packet Count in
                                                // Block Transfer Endpoint 5
#define USB_O_RQPKTCOUNT6            0x00000318 // USB Request Packet Count in
                                                // Block Transfer Endpoint 6
#define USB_O_RQPKTCOUNT7            0x0000031C // USB Request Packet Count in
                                                // Block Transfer Endpoint 7
#define USB_O_RQPKTCOUNT8            0x00000320 // USB Request Packet Count in
                                                // Block Transfer Endpoint 8
#define USB_O_RQPKTCOUNT9            0x00000324 // USB Request Packet Count in
                                                // Block Transfer Endpoint 9
#define USB_O_RQPKTCOUNT10           0x00000328 // USB Request Packet Count in
                                                // Block Transfer Endpoint 10
#define USB_O_RQPKTCOUNT11           0x0000032C // USB Request Packet Count in
                                                // Block Transfer Endpoint 11
#define USB_O_RQPKTCOUNT12           0x00000330 // USB Request Packet Count in
                                                // Block Transfer Endpoint 12
#define USB_O_RQPKTCOUNT13           0x00000334 // USB Request Packet Count in
                                                // Block Transfer Endpoint 13
#define USB_O_RQPKTCOUNT14           0x00000338 // USB Request Packet Count in
                                                // Block Transfer Endpoint 14
#define USB_O_RQPKTCOUNT15           0x0000033C // USB Request Packet Count in
                                                // Block Transfer Endpoint 15
#define USB_O_RXDPKTBUFDIS           0x00000340 // USB Receive Double Packet
                                                // Buffer Disable
#define USB_O_TXDPKTBUFDIS           0x00000342 // USB Transmit Double Packet
                                                // Buffer Disable
#define USB_O_EPC                    0x00000400 // USB External Power Control
#define USB_O_EPCRIS                 0x00000404 // USB External Power Control
                                                // Raw Interrupt Status
#define USB_O_EPCIM                  0x00000408 // USB External Power Control
                                                // Interrupt Mask
#define USB_O_EPCISC                 0x0000040C // USB External Power Control
                                                // Interrupt Status and Clear
#define USB_O_DRRIS                  0x00000410 // USB Device RESUME Raw
                                                // Interrupt Status
#define USB_O_DRIM                   0x00000414 // USB Device RESUME Interrupt
                                                // Mask
#define USB_O_DRISC                  0x00000418 // USB Device RESUME Interrupt
                                                // Status and Clear
#define USB_O_GPCS                   0x0000041C // USB General-Purpose Control
                                                // and Status
#define USB_O_VDC                    0x00000430 // USB VBUS Droop Control
#define USB_O_VDCRIS                 0x00000434 // USB VBUS Droop Control Raw
                                                // Interrupt Status
#define USB_O_VDCIM                  0x00000438 // USB VBUS Droop Control
                                                // Interrupt Mask
#define USB_O_VDCISC                 0x0000043C // USB VBUS Droop Control
                                                // Interrupt Status and Clear
#define USB_O_IDVRIS                 0x00000444 // USB ID Valid Detect Raw
                                                // Interrupt Status
#define USB_O_IDVIM                  0x00000448 // USB ID Valid Detect
                                                // Interrupt Mask
#define USB_O_IDVISC                 0x0000044C // USB ID Valid Detect
                                                // Interrupt Status and Clear
#define USB_O_DMASEL                 0x00000450 // USB DMA Select
#define USB_O_DMARIS                 0x00000500
#define USB_O_DMAMAIM                0x00000504
#define USB_O_DMAISC                 0x00000508

