TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_usb.h
//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBADDR1
// register.
//*****************************************************************************
#define USB_TXHUBADDR1_MULTTRAN      0x00000080 // Multiple Translators
#define USB_TXHUBADDR1_ADDR_M        0x0000007F // Hub Address
#define USB_TXHUBADDR1_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBPORT1
// register.
//*****************************************************************************
#define USB_TXHUBPORT1_PORT_M        0x0000007F // Hub Port
#define USB_TXHUBPORT1_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXFUNCADDR1
// register.
//*****************************************************************************
#define USB_RXFUNCADDR1_ADDR_M       0x0000007F // Device Address
#define USB_RXFUNCADDR1_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBADDR1
// register.
//*****************************************************************************
#define USB_RXHUBADDR1_MULTTRAN      0x00000080 // Multiple Translators
#define USB_RXHUBADDR1_ADDR_M        0x0000007F // Hub Address
#define USB_RXHUBADDR1_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBPORT1
// register.
//*****************************************************************************
#define USB_RXHUBPORT1_PORT_M        0x0000007F // Hub Port
#define USB_RXHUBPORT1_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXFUNCADDR2
// register.
//*****************************************************************************
#define USB_TXFUNCADDR2_ADDR_M       0x0000007F // Device Address
#define USB_TXFUNCADDR2_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBADDR2
// register.
//*****************************************************************************
#define USB_TXHUBADDR2_MULTTRAN      0x00000080 // Multiple Translators
#define USB_TXHUBADDR2_ADDR_M        0x0000007F // Hub Address
#define USB_TXHUBADDR2_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBPORT2
// register.
//*****************************************************************************
#define USB_TXHUBPORT2_PORT_M        0x0000007F // Hub Port
#define USB_TXHUBPORT2_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXFUNCADDR2
// register.
//*****************************************************************************
#define USB_RXFUNCADDR2_ADDR_M       0x0000007F // Device Address
#define USB_RXFUNCADDR2_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBADDR2
// register.
//*****************************************************************************
#define USB_RXHUBADDR2_MULTTRAN      0x00000080 // Multiple Translators
#define USB_RXHUBADDR2_ADDR_M        0x0000007F // Hub Address
#define USB_RXHUBADDR2_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBPORT2
// register.
//*****************************************************************************
#define USB_RXHUBPORT2_PORT_M        0x0000007F // Hub Port
#define USB_RXHUBPORT2_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXFUNCADDR3
// register.
//*****************************************************************************
#define USB_TXFUNCADDR3_ADDR_M       0x0000007F // Device Address
#define USB_TXFUNCADDR3_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBADDR3
// register.
//*****************************************************************************
#define USB_TXHUBADDR3_MULTTRAN      0x00000080 // Multiple Translators
#define USB_TXHUBADDR3_ADDR_M        0x0000007F // Hub Address
#define USB_TXHUBADDR3_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBPORT3
// register.
//*****************************************************************************
#define USB_TXHUBPORT3_PORT_M        0x0000007F // Hub Port
#define USB_TXHUBPORT3_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXFUNCADDR3
// register.
//*****************************************************************************
#define USB_RXFUNCADDR3_ADDR_M       0x0000007F // Device Address
#define USB_RXFUNCADDR3_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBADDR3
// register.
//*****************************************************************************
#define USB_RXHUBADDR3_MULTTRAN      0x00000080 // Multiple Translators
#define USB_RXHUBADDR3_ADDR_M        0x0000007F // Hub Address
#define USB_RXHUBADDR3_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBPORT3
// register.
//*****************************************************************************
#define USB_RXHUBPORT3_PORT_M        0x0000007F // Hub Port
#define USB_RXHUBPORT3_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXFUNCADDR4
// register.
//*****************************************************************************
#define USB_TXFUNCADDR4_ADDR_M       0x0000007F // Device Address
#define USB_TXFUNCADDR4_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBADDR4
// register.
//*****************************************************************************
#define USB_TXHUBADDR4_MULTTRAN      0x00000080 // Multiple Translators
#define USB_TXHUBADDR4_ADDR_M        0x0000007F // Hub Address
#define USB_TXHUBADDR4_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBPORT4
// register.
//*****************************************************************************
#define USB_TXHUBPORT4_PORT_M        0x0000007F // Hub Port
#define USB_TXHUBPORT4_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXFUNCADDR4
// register.
//*****************************************************************************
#define USB_RXFUNCADDR4_ADDR_M       0x0000007F // Device Address
#define USB_RXFUNCADDR4_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBADDR4
// register.
//*****************************************************************************
#define USB_RXHUBADDR4_MULTTRAN      0x00000080 // Multiple Translators
#define USB_RXHUBADDR4_ADDR_M        0x0000007F // Hub Address
#define USB_RXHUBADDR4_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBPORT4
// register.
//*****************************************************************************
#define USB_RXHUBPORT4_PORT_M        0x0000007F // Hub Port
#define USB_RXHUBPORT4_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXFUNCADDR5
// register.
//*****************************************************************************
#define USB_TXFUNCADDR5_ADDR_M       0x0000007F // Device Address
#define USB_TXFUNCADDR5_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBADDR5
// register.
//*****************************************************************************
#define USB_TXHUBADDR5_MULTTRAN      0x00000080 // Multiple Translators
#define USB_TXHUBADDR5_ADDR_M        0x0000007F // Hub Address
#define USB_TXHUBADDR5_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBPORT5
// register.
//*****************************************************************************
#define USB_TXHUBPORT5_PORT_M        0x0000007F // Hub Port
#define USB_TXHUBPORT5_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXFUNCADDR5
// register.
//*****************************************************************************
#define USB_RXFUNCADDR5_ADDR_M       0x0000007F // Device Address
#define USB_RXFUNCADDR5_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBADDR5
// register.
//*****************************************************************************
#define USB_RXHUBADDR5_MULTTRAN      0x00000080 // Multiple Translators
#define USB_RXHUBADDR5_ADDR_M        0x0000007F // Hub Address
#define USB_RXHUBADDR5_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBPORT5
// register.
//*****************************************************************************
#define USB_RXHUBPORT5_PORT_M        0x0000007F // Hub Port
#define USB_RXHUBPORT5_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXFUNCADDR6
// register.
//*****************************************************************************
#define USB_TXFUNCADDR6_ADDR_M       0x0000007F // Device Address
#define USB_TXFUNCADDR6_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBADDR6
// register.
//*****************************************************************************
#define USB_TXHUBADDR6_MULTTRAN      0x00000080 // Multiple Translators
#define USB_TXHUBADDR6_ADDR_M        0x0000007F // Hub Address
#define USB_TXHUBADDR6_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBPORT6
// register.
//*****************************************************************************
#define USB_TXHUBPORT6_PORT_M        0x0000007F // Hub Port
#define USB_TXHUBPORT6_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXFUNCADDR6
// register.
//*****************************************************************************
#define USB_RXFUNCADDR6_ADDR_M       0x0000007F // Device Address
#define USB_RXFUNCADDR6_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBADDR6
// register.
//*****************************************************************************
#define USB_RXHUBADDR6_MULTTRAN      0x00000080 // Multiple Translators
#define USB_RXHUBADDR6_ADDR_M        0x0000007F // Hub Address
#define USB_RXHUBADDR6_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBPORT6
// register.
//*****************************************************************************
#define USB_RXHUBPORT6_PORT_M        0x0000007F // Hub Port
#define USB_RXHUBPORT6_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXFUNCADDR7
// register.
//*****************************************************************************
#define USB_TXFUNCADDR7_ADDR_M       0x0000007F // Device Address
#define USB_TXFUNCADDR7_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBADDR7
// register.
//*****************************************************************************
#define USB_TXHUBADDR7_MULTTRAN      0x00000080 // Multiple Translators
#define USB_TXHUBADDR7_ADDR_M        0x0000007F // Hub Address
#define USB_TXHUBADDR7_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBPORT7
// register.
//*****************************************************************************
#define USB_TXHUBPORT7_PORT_M        0x0000007F // Hub Port
#define USB_TXHUBPORT7_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXFUNCADDR7
// register.
//*****************************************************************************
#define USB_RXFUNCADDR7_ADDR_M       0x0000007F // Device Address
#define USB_RXFUNCADDR7_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBADDR7
// register.
//*****************************************************************************
#define USB_RXHUBADDR7_MULTTRAN      0x00000080 // Multiple Translators
#define USB_RXHUBADDR7_ADDR_M        0x0000007F // Hub Address
#define USB_RXHUBADDR7_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBPORT7
// register.
//*****************************************************************************
#define USB_RXHUBPORT7_PORT_M        0x0000007F // Hub Port
#define USB_RXHUBPORT7_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXFUNCADDR8
// register.
//*****************************************************************************
#define USB_TXFUNCADDR8_ADDR_M       0x0000007F // Device Address
#define USB_TXFUNCADDR8_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBADDR8
// register.
//*****************************************************************************
#define USB_TXHUBADDR8_MULTTRAN      0x00000080 // Multiple Translators
#define USB_TXHUBADDR8_ADDR_M        0x0000007F // Hub Address
#define USB_TXHUBADDR8_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBPORT8
// register.
//*****************************************************************************
#define USB_TXHUBPORT8_PORT_M        0x0000007F // Hub Port
#define USB_TXHUBPORT8_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXFUNCADDR8
// register.
//*****************************************************************************
#define USB_RXFUNCADDR8_ADDR_M       0x0000007F // Device Address
#define USB_RXFUNCADDR8_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBADDR8
// register.
//*****************************************************************************
#define USB_RXHUBADDR8_MULTTRAN      0x00000080 // Multiple Translators
#define USB_RXHUBADDR8_ADDR_M        0x0000007F // Hub Address
#define USB_RXHUBADDR8_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBPORT8
// register.
//*****************************************************************************
#define USB_RXHUBPORT8_PORT_M        0x0000007F // Hub Port
#define USB_RXHUBPORT8_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXFUNCADDR9
// register.
//*****************************************************************************
#define USB_TXFUNCADDR9_ADDR_M       0x0000007F // Device Address
#define USB_TXFUNCADDR9_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBADDR9
// register.
//*****************************************************************************
#define USB_TXHUBADDR9_MULTTRAN      0x00000080 // Multiple Translators
#define USB_TXHUBADDR9_ADDR_M        0x0000007F // Hub Address
#define USB_TXHUBADDR9_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBPORT9
// register.
//*****************************************************************************
#define USB_TXHUBPORT9_PORT_M        0x0000007F // Hub Port
#define USB_TXHUBPORT9_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXFUNCADDR9
// register.
//*****************************************************************************
#define USB_RXFUNCADDR9_ADDR_M       0x0000007F // Device Address
#define USB_RXFUNCADDR9_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBADDR9
// register.
//*****************************************************************************
#define USB_RXHUBADDR9_MULTTRAN      0x00000080 // Multiple Translators
#define USB_RXHUBADDR9_ADDR_M        0x0000007F // Hub Address
#define USB_RXHUBADDR9_ADDR_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBPORT9
// register.
//*****************************************************************************
#define USB_RXHUBPORT9_PORT_M        0x0000007F // Hub Port
#define USB_RXHUBPORT9_PORT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXFUNCADDR10
// register.
//*****************************************************************************
#define USB_TXFUNCADDR10_ADDR_M      0x0000007F // Device Address
#define USB_TXFUNCADDR10_ADDR_S      0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBADDR10
// register.
//*****************************************************************************
#define USB_TXHUBADDR10_MULTTRAN     0x00000080 // Multiple Translators
#define USB_TXHUBADDR10_ADDR_M       0x0000007F // Hub Address
#define USB_TXHUBADDR10_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBPORT10
// register.
//*****************************************************************************
#define USB_TXHUBPORT10_PORT_M       0x0000007F // Hub Port
#define USB_TXHUBPORT10_PORT_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXFUNCADDR10
// register.
//*****************************************************************************
#define USB_RXFUNCADDR10_ADDR_M      0x0000007F // Device Address
#define USB_RXFUNCADDR10_ADDR_S      0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBADDR10
// register.
//*****************************************************************************
#define USB_RXHUBADDR10_MULTTRAN     0x00000080 // Multiple Translators
#define USB_RXHUBADDR10_ADDR_M       0x0000007F // Hub Address
#define USB_RXHUBADDR10_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBPORT10
// register.
//*****************************************************************************
#define USB_RXHUBPORT10_PORT_M       0x0000007F // Hub Port
#define USB_RXHUBPORT10_PORT_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXFUNCADDR11
// register.
//*****************************************************************************
#define USB_TXFUNCADDR11_ADDR_M      0x0000007F // Device Address
#define USB_TXFUNCADDR11_ADDR_S      0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBADDR11
// register.
//*****************************************************************************
#define USB_TXHUBADDR11_MULTTRAN     0x00000080 // Multiple Translators
#define USB_TXHUBADDR11_ADDR_M       0x0000007F // Hub Address
#define USB_TXHUBADDR11_ADDR_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXHUBPORT11
// register.
//*****************************************************************************
#define USB_TXHUBPORT11_PORT_M       0x0000007F // Hub Port
#define USB_TXHUBPORT11_PORT_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXFUNCADDR11
// register.
//*****************************************************************************
#define USB_RXFUNCADDR11_ADDR_M      0x0000007F // Device Address
#define USB_RXFUNCADDR11_ADDR_S      0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXHUBADDR11
// register.
//*****************************************************************************
#define USB_RXHUBADDR11_MULTTRAN     0x00000080 // Multiple Translators
#define USB_RXHUBADDR11_ADDR_M       0x0000007F // Hub Address
#define USB_RXHUBADDR11_ADDR_S       0

