TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_usb.h
//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXINTERVAL5
// register.
//*****************************************************************************
#define USB_RXINTERVAL5_TXPOLL_M     0x000000FF // RX Polling
#define USB_RXINTERVAL5_NAKLMT_M     0x000000FF // NAK Limit
#define USB_RXINTERVAL5_TXPOLL_S     0
#define USB_RXINTERVAL5_NAKLMT_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXMAXP6 register.
//*****************************************************************************
#define USB_TXMAXP6_MAXLOAD_M        0x000007FF // Maximum Payload
#define USB_TXMAXP6_MAXLOAD_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRL6 register.
//*****************************************************************************
#define USB_TXCSRL6_NAKTO            0x00000080 // NAK Timeout
#define USB_TXCSRL6_CLRDT            0x00000040 // Clear Data Toggle
#define USB_TXCSRL6_STALLED          0x00000020 // Endpoint Stalled
#define USB_TXCSRL6_STALL            0x00000010 // Send STALL
#define USB_TXCSRL6_SETUP            0x00000010 // Setup Packet
#define USB_TXCSRL6_FLUSH            0x00000008 // Flush FIFO
#define USB_TXCSRL6_ERROR            0x00000004 // Error
#define USB_TXCSRL6_UNDRN            0x00000004 // Underrun
#define USB_TXCSRL6_FIFONE           0x00000002 // FIFO Not Empty
#define USB_TXCSRL6_TXRDY            0x00000001 // Transmit Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRH6 register.
//*****************************************************************************
#define USB_TXCSRH6_AUTOSET          0x00000080 // Auto Set
#define USB_TXCSRH6_ISO              0x00000040 // Isochronous Transfers
#define USB_TXCSRH6_MODE             0x00000020 // Mode
#define USB_TXCSRH6_DMAEN            0x00000010 // DMA Request Enable
#define USB_TXCSRH6_FDT              0x00000008 // Force Data Toggle
#define USB_TXCSRH6_DMAMOD           0x00000004 // DMA Request Mode
#define USB_TXCSRH6_DTWE             0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH6_DT               0x00000001 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXMAXP6 register.
//*****************************************************************************
#define USB_RXMAXP6_MAXLOAD_M        0x000007FF // Maximum Payload
#define USB_RXMAXP6_MAXLOAD_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRL6 register.
//*****************************************************************************
#define USB_RXCSRL6_CLRDT            0x00000080 // Clear Data Toggle
#define USB_RXCSRL6_STALLED          0x00000040 // Endpoint Stalled
#define USB_RXCSRL6_REQPKT           0x00000020 // Request Packet
#define USB_RXCSRL6_STALL            0x00000020 // Send STALL
#define USB_RXCSRL6_FLUSH            0x00000010 // Flush FIFO
#define USB_RXCSRL6_NAKTO            0x00000008 // NAK Timeout
#define USB_RXCSRL6_DATAERR          0x00000008 // Data Error
#define USB_RXCSRL6_ERROR            0x00000004 // Error
#define USB_RXCSRL6_OVER             0x00000004 // Overrun
#define USB_RXCSRL6_FULL             0x00000002 // FIFO Full
#define USB_RXCSRL6_RXRDY            0x00000001 // Receive Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRH6 register.
//*****************************************************************************
#define USB_RXCSRH6_AUTOCL           0x00000080 // Auto Clear
#define USB_RXCSRH6_AUTORQ           0x00000040 // Auto Request
#define USB_RXCSRH6_ISO              0x00000040 // Isochronous Transfers
#define USB_RXCSRH6_DMAEN            0x00000020 // DMA Request Enable
#define USB_RXCSRH6_DISNYET          0x00000010 // Disable NYET
#define USB_RXCSRH6_PIDERR           0x00000010 // PID Error
#define USB_RXCSRH6_DMAMOD           0x00000008 // DMA Request Mode
#define USB_RXCSRH6_DTWE             0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH6_DT               0x00000002 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCOUNT6 register.
//*****************************************************************************
#define USB_RXCOUNT6_COUNT_M         0x00001FFF // Receive Packet Count
#define USB_RXCOUNT6_COUNT_S         0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXTYPE6 register.
//*****************************************************************************
#define USB_TXTYPE6_SPEED_M          0x000000C0 // Operating Speed
#define USB_TXTYPE6_SPEED_DFLT       0x00000000 // Default
#define USB_TXTYPE6_SPEED_FULL       0x00000080 // Full
#define USB_TXTYPE6_SPEED_LOW        0x000000C0 // Low
#define USB_TXTYPE6_PROTO_M          0x00000030 // Protocol
#define USB_TXTYPE6_PROTO_CTRL       0x00000000 // Control
#define USB_TXTYPE6_PROTO_ISOC       0x00000010 // Isochronous
#define USB_TXTYPE6_PROTO_BULK       0x00000020 // Bulk
#define USB_TXTYPE6_PROTO_INT        0x00000030 // Interrupt
#define USB_TXTYPE6_TEP_M            0x0000000F // Target Endpoint Number
#define USB_TXTYPE6_TEP_S            0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXINTERVAL6
// register.
//*****************************************************************************
#define USB_TXINTERVAL6_TXPOLL_M     0x000000FF // TX Polling
#define USB_TXINTERVAL6_NAKLMT_M     0x000000FF // NAK Limit
#define USB_TXINTERVAL6_TXPOLL_S     0
#define USB_TXINTERVAL6_NAKLMT_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXTYPE6 register.
//*****************************************************************************
#define USB_RXTYPE6_SPEED_M          0x000000C0 // Operating Speed
#define USB_RXTYPE6_SPEED_DFLT       0x00000000 // Default
#define USB_RXTYPE6_SPEED_FULL       0x00000080 // Full
#define USB_RXTYPE6_SPEED_LOW        0x000000C0 // Low
#define USB_RXTYPE6_PROTO_M          0x00000030 // Protocol
#define USB_RXTYPE6_PROTO_CTRL       0x00000000 // Control
#define USB_RXTYPE6_PROTO_ISOC       0x00000010 // Isochronous
#define USB_RXTYPE6_PROTO_BULK       0x00000020 // Bulk
#define USB_RXTYPE6_PROTO_INT        0x00000030 // Interrupt
#define USB_RXTYPE6_TEP_M            0x0000000F // Target Endpoint Number
#define USB_RXTYPE6_TEP_S            0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXINTERVAL6
// register.
//*****************************************************************************
#define USB_RXINTERVAL6_TXPOLL_M     0x000000FF // RX Polling
#define USB_RXINTERVAL6_NAKLMT_M     0x000000FF // NAK Limit
#define USB_RXINTERVAL6_NAKLMT_S     0
#define USB_RXINTERVAL6_TXPOLL_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXMAXP7 register.
//*****************************************************************************
#define USB_TXMAXP7_MAXLOAD_M        0x000007FF // Maximum Payload
#define USB_TXMAXP7_MAXLOAD_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRL7 register.
//*****************************************************************************
#define USB_TXCSRL7_NAKTO            0x00000080 // NAK Timeout
#define USB_TXCSRL7_CLRDT            0x00000040 // Clear Data Toggle
#define USB_TXCSRL7_STALLED          0x00000020 // Endpoint Stalled
#define USB_TXCSRL7_STALL            0x00000010 // Send STALL
#define USB_TXCSRL7_SETUP            0x00000010 // Setup Packet
#define USB_TXCSRL7_FLUSH            0x00000008 // Flush FIFO
#define USB_TXCSRL7_ERROR            0x00000004 // Error
#define USB_TXCSRL7_UNDRN            0x00000004 // Underrun
#define USB_TXCSRL7_FIFONE           0x00000002 // FIFO Not Empty
#define USB_TXCSRL7_TXRDY            0x00000001 // Transmit Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRH7 register.
//*****************************************************************************
#define USB_TXCSRH7_AUTOSET          0x00000080 // Auto Set
#define USB_TXCSRH7_ISO              0x00000040 // Isochronous Transfers
#define USB_TXCSRH7_MODE             0x00000020 // Mode
#define USB_TXCSRH7_DMAEN            0x00000010 // DMA Request Enable
#define USB_TXCSRH7_FDT              0x00000008 // Force Data Toggle
#define USB_TXCSRH7_DMAMOD           0x00000004 // DMA Request Mode
#define USB_TXCSRH7_DTWE             0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH7_DT               0x00000001 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXMAXP7 register.
//*****************************************************************************
#define USB_RXMAXP7_MAXLOAD_M        0x000007FF // Maximum Payload
#define USB_RXMAXP7_MAXLOAD_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRL7 register.
//*****************************************************************************
#define USB_RXCSRL7_CLRDT            0x00000080 // Clear Data Toggle
#define USB_RXCSRL7_STALLED          0x00000040 // Endpoint Stalled
#define USB_RXCSRL7_REQPKT           0x00000020 // Request Packet
#define USB_RXCSRL7_STALL            0x00000020 // Send STALL
#define USB_RXCSRL7_FLUSH            0x00000010 // Flush FIFO
#define USB_RXCSRL7_DATAERR          0x00000008 // Data Error
#define USB_RXCSRL7_NAKTO            0x00000008 // NAK Timeout
#define USB_RXCSRL7_ERROR            0x00000004 // Error
#define USB_RXCSRL7_OVER             0x00000004 // Overrun
#define USB_RXCSRL7_FULL             0x00000002 // FIFO Full
#define USB_RXCSRL7_RXRDY            0x00000001 // Receive Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRH7 register.
//*****************************************************************************
#define USB_RXCSRH7_AUTOCL           0x00000080 // Auto Clear
#define USB_RXCSRH7_ISO              0x00000040 // Isochronous Transfers
#define USB_RXCSRH7_AUTORQ           0x00000040 // Auto Request
#define USB_RXCSRH7_DMAEN            0x00000020 // DMA Request Enable
#define USB_RXCSRH7_PIDERR           0x00000010 // PID Error
#define USB_RXCSRH7_DISNYET          0x00000010 // Disable NYET
#define USB_RXCSRH7_DMAMOD           0x00000008 // DMA Request Mode
#define USB_RXCSRH7_DTWE             0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH7_DT               0x00000002 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCOUNT7 register.
//*****************************************************************************
#define USB_RXCOUNT7_COUNT_M         0x00001FFF // Receive Packet Count
#define USB_RXCOUNT7_COUNT_S         0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXTYPE7 register.
//*****************************************************************************
#define USB_TXTYPE7_SPEED_M          0x000000C0 // Operating Speed
#define USB_TXTYPE7_SPEED_DFLT       0x00000000 // Default
#define USB_TXTYPE7_SPEED_FULL       0x00000080 // Full
#define USB_TXTYPE7_SPEED_LOW        0x000000C0 // Low
#define USB_TXTYPE7_PROTO_M          0x00000030 // Protocol
#define USB_TXTYPE7_PROTO_CTRL       0x00000000 // Control
#define USB_TXTYPE7_PROTO_ISOC       0x00000010 // Isochronous
#define USB_TXTYPE7_PROTO_BULK       0x00000020 // Bulk
#define USB_TXTYPE7_PROTO_INT        0x00000030 // Interrupt
#define USB_TXTYPE7_TEP_M            0x0000000F // Target Endpoint Number
#define USB_TXTYPE7_TEP_S            0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXINTERVAL7
// register.
//*****************************************************************************
#define USB_TXINTERVAL7_TXPOLL_M     0x000000FF // TX Polling
#define USB_TXINTERVAL7_NAKLMT_M     0x000000FF // NAK Limit
#define USB_TXINTERVAL7_NAKLMT_S     0
#define USB_TXINTERVAL7_TXPOLL_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXTYPE7 register.
//*****************************************************************************
#define USB_RXTYPE7_SPEED_M          0x000000C0 // Operating Speed
#define USB_RXTYPE7_SPEED_DFLT       0x00000000 // Default
#define USB_RXTYPE7_SPEED_FULL       0x00000080 // Full
#define USB_RXTYPE7_SPEED_LOW        0x000000C0 // Low
#define USB_RXTYPE7_PROTO_M          0x00000030 // Protocol
#define USB_RXTYPE7_PROTO_CTRL       0x00000000 // Control
#define USB_RXTYPE7_PROTO_ISOC       0x00000010 // Isochronous
#define USB_RXTYPE7_PROTO_BULK       0x00000020 // Bulk
#define USB_RXTYPE7_PROTO_INT        0x00000030 // Interrupt
#define USB_RXTYPE7_TEP_M            0x0000000F // Target Endpoint Number
#define USB_RXTYPE7_TEP_S            0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXINTERVAL7
// register.
//*****************************************************************************
#define USB_RXINTERVAL7_TXPOLL_M     0x000000FF // RX Polling
#define USB_RXINTERVAL7_NAKLMT_M     0x000000FF // NAK Limit
#define USB_RXINTERVAL7_NAKLMT_S     0
#define USB_RXINTERVAL7_TXPOLL_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXMAXP8 register.
//*****************************************************************************
#define USB_TXMAXP8_MAXLOAD_M        0x000007FF // Maximum Payload
#define USB_TXMAXP8_MAXLOAD_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRL8 register.
//*****************************************************************************
#define USB_TXCSRL8_NAKTO            0x00000080 // NAK Timeout
#define USB_TXCSRL8_CLRDT            0x00000040 // Clear Data Toggle
#define USB_TXCSRL8_STALLED          0x00000020 // Endpoint Stalled
#define USB_TXCSRL8_STALL            0x00000010 // Send STALL
#define USB_TXCSRL8_SETUP            0x00000010 // Setup Packet
#define USB_TXCSRL8_FLUSH            0x00000008 // Flush FIFO
#define USB_TXCSRL8_ERROR            0x00000004 // Error
#define USB_TXCSRL8_UNDRN            0x00000004 // Underrun
#define USB_TXCSRL8_FIFONE           0x00000002 // FIFO Not Empty
#define USB_TXCSRL8_TXRDY            0x00000001 // Transmit Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRH8 register.
//*****************************************************************************
#define USB_TXCSRH8_AUTOSET          0x00000080 // Auto Set
#define USB_TXCSRH8_ISO              0x00000040 // Isochronous Transfers
#define USB_TXCSRH8_MODE             0x00000020 // Mode
#define USB_TXCSRH8_DMAEN            0x00000010 // DMA Request Enable
#define USB_TXCSRH8_FDT              0x00000008 // Force Data Toggle
#define USB_TXCSRH8_DMAMOD           0x00000004 // DMA Request Mode
#define USB_TXCSRH8_DTWE             0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH8_DT               0x00000001 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXMAXP8 register.
//*****************************************************************************
#define USB_RXMAXP8_MAXLOAD_M        0x000007FF // Maximum Payload
#define USB_RXMAXP8_MAXLOAD_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRL8 register.
//*****************************************************************************
#define USB_RXCSRL8_CLRDT            0x00000080 // Clear Data Toggle
#define USB_RXCSRL8_STALLED          0x00000040 // Endpoint Stalled
#define USB_RXCSRL8_STALL            0x00000020 // Send STALL
#define USB_RXCSRL8_REQPKT           0x00000020 // Request Packet
#define USB_RXCSRL8_FLUSH            0x00000010 // Flush FIFO
#define USB_RXCSRL8_NAKTO            0x00000008 // NAK Timeout
#define USB_RXCSRL8_DATAERR          0x00000008 // Data Error
#define USB_RXCSRL8_OVER             0x00000004 // Overrun
#define USB_RXCSRL8_ERROR            0x00000004 // Error
#define USB_RXCSRL8_FULL             0x00000002 // FIFO Full
#define USB_RXCSRL8_RXRDY            0x00000001 // Receive Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRH8 register.
//*****************************************************************************
#define USB_RXCSRH8_AUTOCL           0x00000080 // Auto Clear
#define USB_RXCSRH8_AUTORQ           0x00000040 // Auto Request
#define USB_RXCSRH8_ISO              0x00000040 // Isochronous Transfers
#define USB_RXCSRH8_DMAEN            0x00000020 // DMA Request Enable
#define USB_RXCSRH8_DISNYET          0x00000010 // Disable NYET
#define USB_RXCSRH8_PIDERR           0x00000010 // PID Error
#define USB_RXCSRH8_DMAMOD           0x00000008 // DMA Request Mode
#define USB_RXCSRH8_DTWE             0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH8_DT               0x00000002 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCOUNT8 register.
//*****************************************************************************
#define USB_RXCOUNT8_COUNT_M         0x00001FFF // Receive Packet Count
#define USB_RXCOUNT8_COUNT_S         0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXTYPE8 register.
//*****************************************************************************
#define USB_TXTYPE8_SPEED_M          0x000000C0 // Operating Speed
#define USB_TXTYPE8_SPEED_DFLT       0x00000000 // Default
#define USB_TXTYPE8_SPEED_FULL       0x00000080 // Full
#define USB_TXTYPE8_SPEED_LOW        0x000000C0 // Low
#define USB_TXTYPE8_PROTO_M          0x00000030 // Protocol
#define USB_TXTYPE8_PROTO_CTRL       0x00000000 // Control
#define USB_TXTYPE8_PROTO_ISOC       0x00000010 // Isochronous
#define USB_TXTYPE8_PROTO_BULK       0x00000020 // Bulk
#define USB_TXTYPE8_PROTO_INT        0x00000030 // Interrupt
#define USB_TXTYPE8_TEP_M            0x0000000F // Target Endpoint Number
#define USB_TXTYPE8_TEP_S            0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXINTERVAL8
// register.
//*****************************************************************************
#define USB_TXINTERVAL8_TXPOLL_M     0x000000FF // TX Polling
#define USB_TXINTERVAL8_NAKLMT_M     0x000000FF // NAK Limit
#define USB_TXINTERVAL8_NAKLMT_S     0
#define USB_TXINTERVAL8_TXPOLL_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXTYPE8 register.
//*****************************************************************************
#define USB_RXTYPE8_SPEED_M          0x000000C0 // Operating Speed
#define USB_RXTYPE8_SPEED_DFLT       0x00000000 // Default
#define USB_RXTYPE8_SPEED_FULL       0x00000080 // Full
#define USB_RXTYPE8_SPEED_LOW        0x000000C0 // Low
#define USB_RXTYPE8_PROTO_M          0x00000030 // Protocol
#define USB_RXTYPE8_PROTO_CTRL       0x00000000 // Control
#define USB_RXTYPE8_PROTO_ISOC       0x00000010 // Isochronous
#define USB_RXTYPE8_PROTO_BULK       0x00000020 // Bulk
#define USB_RXTYPE8_PROTO_INT        0x00000030 // Interrupt
#define USB_RXTYPE8_TEP_M            0x0000000F // Target Endpoint Number
#define USB_RXTYPE8_TEP_S            0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXINTERVAL8
// register.
//*****************************************************************************
#define USB_RXINTERVAL8_NAKLMT_M     0x000000FF // NAK Limit
#define USB_RXINTERVAL8_TXPOLL_M     0x000000FF // RX Polling
#define USB_RXINTERVAL8_NAKLMT_S     0
#define USB_RXINTERVAL8_TXPOLL_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXMAXP9 register.
//*****************************************************************************
#define USB_TXMAXP9_MAXLOAD_M        0x000007FF // Maximum Payload
#define USB_TXMAXP9_MAXLOAD_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRL9 register.
//*****************************************************************************
#define USB_TXCSRL9_NAKTO            0x00000080 // NAK Timeout
#define USB_TXCSRL9_CLRDT            0x00000040 // Clear Data Toggle
#define USB_TXCSRL9_STALLED          0x00000020 // Endpoint Stalled
#define USB_TXCSRL9_SETUP            0x00000010 // Setup Packet
#define USB_TXCSRL9_STALL            0x00000010 // Send STALL
#define USB_TXCSRL9_FLUSH            0x00000008 // Flush FIFO
#define USB_TXCSRL9_ERROR            0x00000004 // Error
#define USB_TXCSRL9_UNDRN            0x00000004 // Underrun
#define USB_TXCSRL9_FIFONE           0x00000002 // FIFO Not Empty
#define USB_TXCSRL9_TXRDY            0x00000001 // Transmit Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRH9 register.
//*****************************************************************************
#define USB_TXCSRH9_AUTOSET          0x00000080 // Auto Set
#define USB_TXCSRH9_ISO              0x00000040 // Isochronous Transfers
#define USB_TXCSRH9_MODE             0x00000020 // Mode
#define USB_TXCSRH9_DMAEN            0x00000010 // DMA Request Enable
#define USB_TXCSRH9_FDT              0x00000008 // Force Data Toggle
#define USB_TXCSRH9_DMAMOD           0x00000004 // DMA Request Mode
#define USB_TXCSRH9_DTWE             0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH9_DT               0x00000001 // Data Toggle

