TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_usb.h
//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXMAXP9 register.
//*****************************************************************************
#define USB_RXMAXP9_MAXLOAD_M        0x000007FF // Maximum Payload
#define USB_RXMAXP9_MAXLOAD_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRL9 register.
//*****************************************************************************
#define USB_RXCSRL9_CLRDT            0x00000080 // Clear Data Toggle
#define USB_RXCSRL9_STALLED          0x00000040 // Endpoint Stalled
#define USB_RXCSRL9_STALL            0x00000020 // Send STALL
#define USB_RXCSRL9_REQPKT           0x00000020 // Request Packet
#define USB_RXCSRL9_FLUSH            0x00000010 // Flush FIFO
#define USB_RXCSRL9_DATAERR          0x00000008 // Data Error
#define USB_RXCSRL9_NAKTO            0x00000008 // NAK Timeout
#define USB_RXCSRL9_ERROR            0x00000004 // Error
#define USB_RXCSRL9_OVER             0x00000004 // Overrun
#define USB_RXCSRL9_FULL             0x00000002 // FIFO Full
#define USB_RXCSRL9_RXRDY            0x00000001 // Receive Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRH9 register.
//*****************************************************************************
#define USB_RXCSRH9_AUTOCL           0x00000080 // Auto Clear
#define USB_RXCSRH9_ISO              0x00000040 // Isochronous Transfers
#define USB_RXCSRH9_AUTORQ           0x00000040 // Auto Request
#define USB_RXCSRH9_DMAEN            0x00000020 // DMA Request Enable
#define USB_RXCSRH9_PIDERR           0x00000010 // PID Error
#define USB_RXCSRH9_DISNYET          0x00000010 // Disable NYET
#define USB_RXCSRH9_DMAMOD           0x00000008 // DMA Request Mode
#define USB_RXCSRH9_DTWE             0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH9_DT               0x00000002 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCOUNT9 register.
//*****************************************************************************
#define USB_RXCOUNT9_COUNT_M         0x00001FFF // Receive Packet Count
#define USB_RXCOUNT9_COUNT_S         0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXTYPE9 register.
//*****************************************************************************
#define USB_TXTYPE9_SPEED_M          0x000000C0 // Operating Speed
#define USB_TXTYPE9_SPEED_DFLT       0x00000000 // Default
#define USB_TXTYPE9_SPEED_FULL       0x00000080 // Full
#define USB_TXTYPE9_SPEED_LOW        0x000000C0 // Low
#define USB_TXTYPE9_PROTO_M          0x00000030 // Protocol
#define USB_TXTYPE9_PROTO_CTRL       0x00000000 // Control
#define USB_TXTYPE9_PROTO_ISOC       0x00000010 // Isochronous
#define USB_TXTYPE9_PROTO_BULK       0x00000020 // Bulk
#define USB_TXTYPE9_PROTO_INT        0x00000030 // Interrupt
#define USB_TXTYPE9_TEP_M            0x0000000F // Target Endpoint Number
#define USB_TXTYPE9_TEP_S            0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXINTERVAL9
// register.
//*****************************************************************************
#define USB_TXINTERVAL9_TXPOLL_M     0x000000FF // TX Polling
#define USB_TXINTERVAL9_NAKLMT_M     0x000000FF // NAK Limit
#define USB_TXINTERVAL9_TXPOLL_S     0
#define USB_TXINTERVAL9_NAKLMT_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXTYPE9 register.
//*****************************************************************************
#define USB_RXTYPE9_SPEED_M          0x000000C0 // Operating Speed
#define USB_RXTYPE9_SPEED_DFLT       0x00000000 // Default
#define USB_RXTYPE9_SPEED_FULL       0x00000080 // Full
#define USB_RXTYPE9_SPEED_LOW        0x000000C0 // Low
#define USB_RXTYPE9_PROTO_M          0x00000030 // Protocol
#define USB_RXTYPE9_PROTO_CTRL       0x00000000 // Control
#define USB_RXTYPE9_PROTO_ISOC       0x00000010 // Isochronous
#define USB_RXTYPE9_PROTO_BULK       0x00000020 // Bulk
#define USB_RXTYPE9_PROTO_INT        0x00000030 // Interrupt
#define USB_RXTYPE9_TEP_M            0x0000000F // Target Endpoint Number
#define USB_RXTYPE9_TEP_S            0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXINTERVAL9
// register.
//*****************************************************************************
#define USB_RXINTERVAL9_TXPOLL_M     0x000000FF // RX Polling
#define USB_RXINTERVAL9_NAKLMT_M     0x000000FF // NAK Limit
#define USB_RXINTERVAL9_NAKLMT_S     0
#define USB_RXINTERVAL9_TXPOLL_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXMAXP10 register.
//*****************************************************************************
#define USB_TXMAXP10_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_TXMAXP10_MAXLOAD_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRL10 register.
//*****************************************************************************
#define USB_TXCSRL10_NAKTO           0x00000080 // NAK Timeout
#define USB_TXCSRL10_CLRDT           0x00000040 // Clear Data Toggle
#define USB_TXCSRL10_STALLED         0x00000020 // Endpoint Stalled
#define USB_TXCSRL10_SETUP           0x00000010 // Setup Packet
#define USB_TXCSRL10_STALL           0x00000010 // Send STALL
#define USB_TXCSRL10_FLUSH           0x00000008 // Flush FIFO
#define USB_TXCSRL10_UNDRN           0x00000004 // Underrun
#define USB_TXCSRL10_ERROR           0x00000004 // Error
#define USB_TXCSRL10_FIFONE          0x00000002 // FIFO Not Empty
#define USB_TXCSRL10_TXRDY           0x00000001 // Transmit Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRH10 register.
//*****************************************************************************
#define USB_TXCSRH10_AUTOSET         0x00000080 // Auto Set
#define USB_TXCSRH10_ISO             0x00000040 // Isochronous Transfers
#define USB_TXCSRH10_MODE            0x00000020 // Mode
#define USB_TXCSRH10_DMAEN           0x00000010 // DMA Request Enable
#define USB_TXCSRH10_FDT             0x00000008 // Force Data Toggle
#define USB_TXCSRH10_DMAMOD          0x00000004 // DMA Request Mode
#define USB_TXCSRH10_DTWE            0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH10_DT              0x00000001 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXMAXP10 register.
//*****************************************************************************
#define USB_RXMAXP10_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_RXMAXP10_MAXLOAD_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRL10 register.
//*****************************************************************************
#define USB_RXCSRL10_CLRDT           0x00000080 // Clear Data Toggle
#define USB_RXCSRL10_STALLED         0x00000040 // Endpoint Stalled
#define USB_RXCSRL10_STALL           0x00000020 // Send STALL
#define USB_RXCSRL10_REQPKT          0x00000020 // Request Packet
#define USB_RXCSRL10_FLUSH           0x00000010 // Flush FIFO
#define USB_RXCSRL10_NAKTO           0x00000008 // NAK Timeout
#define USB_RXCSRL10_DATAERR         0x00000008 // Data Error
#define USB_RXCSRL10_OVER            0x00000004 // Overrun
#define USB_RXCSRL10_ERROR           0x00000004 // Error
#define USB_RXCSRL10_FULL            0x00000002 // FIFO Full
#define USB_RXCSRL10_RXRDY           0x00000001 // Receive Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRH10 register.
//*****************************************************************************
#define USB_RXCSRH10_AUTOCL          0x00000080 // Auto Clear
#define USB_RXCSRH10_AUTORQ          0x00000040 // Auto Request
#define USB_RXCSRH10_ISO             0x00000040 // Isochronous Transfers
#define USB_RXCSRH10_DMAEN           0x00000020 // DMA Request Enable
#define USB_RXCSRH10_PIDERR          0x00000010 // PID Error
#define USB_RXCSRH10_DISNYET         0x00000010 // Disable NYET
#define USB_RXCSRH10_DMAMOD          0x00000008 // DMA Request Mode
#define USB_RXCSRH10_DTWE            0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH10_DT              0x00000002 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCOUNT10
// register.
//*****************************************************************************
#define USB_RXCOUNT10_COUNT_M        0x00001FFF // Receive Packet Count
#define USB_RXCOUNT10_COUNT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXTYPE10 register.
//*****************************************************************************
#define USB_TXTYPE10_SPEED_M         0x000000C0 // Operating Speed
#define USB_TXTYPE10_SPEED_DFLT      0x00000000 // Default
#define USB_TXTYPE10_SPEED_FULL      0x00000080 // Full
#define USB_TXTYPE10_SPEED_LOW       0x000000C0 // Low
#define USB_TXTYPE10_PROTO_M         0x00000030 // Protocol
#define USB_TXTYPE10_PROTO_CTRL      0x00000000 // Control
#define USB_TXTYPE10_PROTO_ISOC      0x00000010 // Isochronous
#define USB_TXTYPE10_PROTO_BULK      0x00000020 // Bulk
#define USB_TXTYPE10_PROTO_INT       0x00000030 // Interrupt
#define USB_TXTYPE10_TEP_M           0x0000000F // Target Endpoint Number
#define USB_TXTYPE10_TEP_S           0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXINTERVAL10
// register.
//*****************************************************************************
#define USB_TXINTERVAL10_NAKLMT_M    0x000000FF // NAK Limit
#define USB_TXINTERVAL10_TXPOLL_M    0x000000FF  // TX Polling
#define USB_TXINTERVAL10_TXPOLL_S    0
#define USB_TXINTERVAL10_NAKLMT_S    0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXTYPE10 register.
//*****************************************************************************
#define USB_RXTYPE10_SPEED_M         0x000000C0 // Operating Speed
#define USB_RXTYPE10_SPEED_DFLT      0x00000000 // Default
#define USB_RXTYPE10_SPEED_FULL      0x00000080 // Full
#define USB_RXTYPE10_SPEED_LOW       0x000000C0 // Low
#define USB_RXTYPE10_PROTO_M         0x00000030 // Protocol
#define USB_RXTYPE10_PROTO_CTRL      0x00000000 // Control
#define USB_RXTYPE10_PROTO_ISOC      0x00000010 // Isochronous
#define USB_RXTYPE10_PROTO_BULK      0x00000020 // Bulk
#define USB_RXTYPE10_PROTO_INT       0x00000030 // Interrupt
#define USB_RXTYPE10_TEP_M           0x0000000F // Target Endpoint Number
#define USB_RXTYPE10_TEP_S           0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXINTERVAL10
// register.
//*****************************************************************************
#define USB_RXINTERVAL10_NAKLMT_M    0x000000FF // NAK Limit
#define USB_RXINTERVAL10_TXPOLL_M    0x000000FF // RX Polling
#define USB_RXINTERVAL10_TXPOLL_S    0
#define USB_RXINTERVAL10_NAKLMT_S    0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXMAXP11 register.
//*****************************************************************************
#define USB_TXMAXP11_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_TXMAXP11_MAXLOAD_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRL11 register.
//*****************************************************************************
#define USB_TXCSRL11_NAKTO           0x00000080 // NAK Timeout
#define USB_TXCSRL11_CLRDT           0x00000040 // Clear Data Toggle
#define USB_TXCSRL11_STALLED         0x00000020 // Endpoint Stalled
#define USB_TXCSRL11_STALL           0x00000010 // Send STALL
#define USB_TXCSRL11_SETUP           0x00000010 // Setup Packet
#define USB_TXCSRL11_FLUSH           0x00000008 // Flush FIFO
#define USB_TXCSRL11_ERROR           0x00000004 // Error
#define USB_TXCSRL11_UNDRN           0x00000004 // Underrun
#define USB_TXCSRL11_FIFONE          0x00000002 // FIFO Not Empty
#define USB_TXCSRL11_TXRDY           0x00000001 // Transmit Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRH11 register.
//*****************************************************************************
#define USB_TXCSRH11_AUTOSET         0x00000080 // Auto Set
#define USB_TXCSRH11_ISO             0x00000040 // Isochronous Transfers
#define USB_TXCSRH11_MODE            0x00000020 // Mode
#define USB_TXCSRH11_DMAEN           0x00000010 // DMA Request Enable
#define USB_TXCSRH11_FDT             0x00000008 // Force Data Toggle
#define USB_TXCSRH11_DMAMOD          0x00000004 // DMA Request Mode
#define USB_TXCSRH11_DTWE            0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH11_DT              0x00000001 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXMAXP11 register.
//*****************************************************************************
#define USB_RXMAXP11_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_RXMAXP11_MAXLOAD_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRL11 register.
//*****************************************************************************
#define USB_RXCSRL11_CLRDT           0x00000080 // Clear Data Toggle
#define USB_RXCSRL11_STALLED         0x00000040 // Endpoint Stalled
#define USB_RXCSRL11_STALL           0x00000020 // Send STALL
#define USB_RXCSRL11_REQPKT          0x00000020 // Request Packet
#define USB_RXCSRL11_FLUSH           0x00000010 // Flush FIFO
#define USB_RXCSRL11_DATAERR         0x00000008 // Data Error
#define USB_RXCSRL11_NAKTO           0x00000008 // NAK Timeout
#define USB_RXCSRL11_OVER            0x00000004 // Overrun
#define USB_RXCSRL11_ERROR           0x00000004 // Error
#define USB_RXCSRL11_FULL            0x00000002 // FIFO Full
#define USB_RXCSRL11_RXRDY           0x00000001 // Receive Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRH11 register.
//*****************************************************************************
#define USB_RXCSRH11_AUTOCL          0x00000080 // Auto Clear
#define USB_RXCSRH11_ISO             0x00000040 // Isochronous Transfers
#define USB_RXCSRH11_AUTORQ          0x00000040 // Auto Request
#define USB_RXCSRH11_DMAEN           0x00000020 // DMA Request Enable
#define USB_RXCSRH11_DISNYET         0x00000010 // Disable NYET
#define USB_RXCSRH11_PIDERR          0x00000010 // PID Error
#define USB_RXCSRH11_DMAMOD          0x00000008 // DMA Request Mode
#define USB_RXCSRH11_DTWE            0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH11_DT              0x00000002 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCOUNT11
// register.
//*****************************************************************************
#define USB_RXCOUNT11_COUNT_M        0x00001FFF // Receive Packet Count
#define USB_RXCOUNT11_COUNT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXTYPE11 register.
//*****************************************************************************
#define USB_TXTYPE11_SPEED_M         0x000000C0 // Operating Speed
#define USB_TXTYPE11_SPEED_DFLT      0x00000000 // Default
#define USB_TXTYPE11_SPEED_FULL      0x00000080 // Full
#define USB_TXTYPE11_SPEED_LOW       0x000000C0 // Low
#define USB_TXTYPE11_PROTO_M         0x00000030 // Protocol
#define USB_TXTYPE11_PROTO_CTRL      0x00000000 // Control
#define USB_TXTYPE11_PROTO_ISOC      0x00000010 // Isochronous
#define USB_TXTYPE11_PROTO_BULK      0x00000020 // Bulk
#define USB_TXTYPE11_PROTO_INT       0x00000030 // Interrupt
#define USB_TXTYPE11_TEP_M           0x0000000F // Target Endpoint Number
#define USB_TXTYPE11_TEP_S           0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXINTERVAL11
// register.
//*****************************************************************************
#define USB_TXINTERVAL11_TXPOLL_M    0x000000FF // TX Polling
#define USB_TXINTERVAL11_NAKLMT_M    0x000000FF // NAK Limit
#define USB_TXINTERVAL11_NAKLMT_S    0
#define USB_TXINTERVAL11_TXPOLL_S    0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXTYPE11 register.
//*****************************************************************************
#define USB_RXTYPE11_SPEED_M         0x000000C0 // Operating Speed
#define USB_RXTYPE11_SPEED_DFLT      0x00000000 // Default
#define USB_RXTYPE11_SPEED_FULL      0x00000080 // Full
#define USB_RXTYPE11_SPEED_LOW       0x000000C0 // Low
#define USB_RXTYPE11_PROTO_M         0x00000030 // Protocol
#define USB_RXTYPE11_PROTO_CTRL      0x00000000 // Control
#define USB_RXTYPE11_PROTO_ISOC      0x00000010 // Isochronous
#define USB_RXTYPE11_PROTO_BULK      0x00000020 // Bulk
#define USB_RXTYPE11_PROTO_INT       0x00000030 // Interrupt
#define USB_RXTYPE11_TEP_M           0x0000000F // Target Endpoint Number
#define USB_RXTYPE11_TEP_S           0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXINTERVAL11
// register.
//*****************************************************************************
#define USB_RXINTERVAL11_NAKLMT_M    0x000000FF // NAK Limit
#define USB_RXINTERVAL11_TXPOLL_M    0x000000FF // RX Polling
#define USB_RXINTERVAL11_TXPOLL_S    0
#define USB_RXINTERVAL11_NAKLMT_S    0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXMAXP12 register.
//*****************************************************************************
#define USB_TXMAXP12_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_TXMAXP12_MAXLOAD_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRL12 register.
//*****************************************************************************
#define USB_TXCSRL12_NAKTO           0x00000080 // NAK Timeout
#define USB_TXCSRL12_CLRDT           0x00000040 // Clear Data Toggle
#define USB_TXCSRL12_STALLED         0x00000020 // Endpoint Stalled
#define USB_TXCSRL12_SETUP           0x00000010 // Setup Packet
#define USB_TXCSRL12_STALL           0x00000010 // Send STALL
#define USB_TXCSRL12_FLUSH           0x00000008 // Flush FIFO
#define USB_TXCSRL12_UNDRN           0x00000004 // Underrun
#define USB_TXCSRL12_ERROR           0x00000004 // Error
#define USB_TXCSRL12_FIFONE          0x00000002 // FIFO Not Empty
#define USB_TXCSRL12_TXRDY           0x00000001 // Transmit Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRH12 register.
//*****************************************************************************
#define USB_TXCSRH12_AUTOSET         0x00000080 // Auto Set
#define USB_TXCSRH12_ISO             0x00000040 // Isochronous Transfers
#define USB_TXCSRH12_MODE            0x00000020 // Mode
#define USB_TXCSRH12_DMAEN           0x00000010 // DMA Request Enable
#define USB_TXCSRH12_FDT             0x00000008 // Force Data Toggle
#define USB_TXCSRH12_DMAMOD          0x00000004 // DMA Request Mode
#define USB_TXCSRH12_DTWE            0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH12_DT              0x00000001 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXMAXP12 register.
//*****************************************************************************
#define USB_RXMAXP12_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_RXMAXP12_MAXLOAD_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRL12 register.
//*****************************************************************************
#define USB_RXCSRL12_CLRDT           0x00000080 // Clear Data Toggle
#define USB_RXCSRL12_STALLED         0x00000040 // Endpoint Stalled
#define USB_RXCSRL12_STALL           0x00000020 // Send STALL
#define USB_RXCSRL12_REQPKT          0x00000020 // Request Packet
#define USB_RXCSRL12_FLUSH           0x00000010 // Flush FIFO
#define USB_RXCSRL12_NAKTO           0x00000008 // NAK Timeout
#define USB_RXCSRL12_DATAERR         0x00000008 // Data Error
#define USB_RXCSRL12_ERROR           0x00000004 // Error
#define USB_RXCSRL12_OVER            0x00000004 // Overrun
#define USB_RXCSRL12_FULL            0x00000002 // FIFO Full
#define USB_RXCSRL12_RXRDY           0x00000001 // Receive Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRH12 register.
//*****************************************************************************
#define USB_RXCSRH12_AUTOCL          0x00000080 // Auto Clear
#define USB_RXCSRH12_ISO             0x00000040 // Isochronous Transfers
#define USB_RXCSRH12_AUTORQ          0x00000040 // Auto Request
#define USB_RXCSRH12_DMAEN           0x00000020 // DMA Request Enable
#define USB_RXCSRH12_PIDERR          0x00000010 // PID Error
#define USB_RXCSRH12_DISNYET         0x00000010 // Disable NYET
#define USB_RXCSRH12_DMAMOD          0x00000008 // DMA Request Mode
#define USB_RXCSRH12_DTWE            0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH12_DT              0x00000002 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCOUNT12
// register.
//*****************************************************************************
#define USB_RXCOUNT12_COUNT_M        0x00001FFF // Receive Packet Count
#define USB_RXCOUNT12_COUNT_S        0

