TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_usb.h
//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXTYPE12 register.
//*****************************************************************************
#define USB_TXTYPE12_SPEED_M         0x000000C0 // Operating Speed
#define USB_TXTYPE12_SPEED_DFLT      0x00000000 // Default
#define USB_TXTYPE12_SPEED_FULL      0x00000080 // Full
#define USB_TXTYPE12_SPEED_LOW       0x000000C0 // Low
#define USB_TXTYPE12_PROTO_M         0x00000030 // Protocol
#define USB_TXTYPE12_PROTO_CTRL      0x00000000 // Control
#define USB_TXTYPE12_PROTO_ISOC      0x00000010 // Isochronous
#define USB_TXTYPE12_PROTO_BULK      0x00000020 // Bulk
#define USB_TXTYPE12_PROTO_INT       0x00000030 // Interrupt
#define USB_TXTYPE12_TEP_M           0x0000000F // Target Endpoint Number
#define USB_TXTYPE12_TEP_S           0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXINTERVAL12
// register.
//*****************************************************************************
#define USB_TXINTERVAL12_TXPOLL_M    0x000000FF // TX Polling
#define USB_TXINTERVAL12_NAKLMT_M    0x000000FF // NAK Limit
#define USB_TXINTERVAL12_TXPOLL_S    0
#define USB_TXINTERVAL12_NAKLMT_S    0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXTYPE12 register.
//*****************************************************************************
#define USB_RXTYPE12_SPEED_M         0x000000C0 // Operating Speed
#define USB_RXTYPE12_SPEED_DFLT      0x00000000 // Default
#define USB_RXTYPE12_SPEED_FULL      0x00000080 // Full
#define USB_RXTYPE12_SPEED_LOW       0x000000C0 // Low
#define USB_RXTYPE12_PROTO_M         0x00000030 // Protocol
#define USB_RXTYPE12_PROTO_CTRL      0x00000000 // Control
#define USB_RXTYPE12_PROTO_ISOC      0x00000010 // Isochronous
#define USB_RXTYPE12_PROTO_BULK      0x00000020 // Bulk
#define USB_RXTYPE12_PROTO_INT       0x00000030 // Interrupt
#define USB_RXTYPE12_TEP_M           0x0000000F // Target Endpoint Number
#define USB_RXTYPE12_TEP_S           0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXINTERVAL12
// register.
//*****************************************************************************
#define USB_RXINTERVAL12_NAKLMT_M    0x000000FF // NAK Limit
#define USB_RXINTERVAL12_TXPOLL_M    0x000000FF // RX Polling
#define USB_RXINTERVAL12_NAKLMT_S    0
#define USB_RXINTERVAL12_TXPOLL_S    0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXMAXP13 register.
//*****************************************************************************
#define USB_TXMAXP13_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_TXMAXP13_MAXLOAD_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRL13 register.
//*****************************************************************************
#define USB_TXCSRL13_NAKTO           0x00000080 // NAK Timeout
#define USB_TXCSRL13_CLRDT           0x00000040 // Clear Data Toggle
#define USB_TXCSRL13_STALLED         0x00000020 // Endpoint Stalled
#define USB_TXCSRL13_SETUP           0x00000010 // Setup Packet
#define USB_TXCSRL13_STALL           0x00000010 // Send STALL
#define USB_TXCSRL13_FLUSH           0x00000008 // Flush FIFO
#define USB_TXCSRL13_UNDRN           0x00000004 // Underrun
#define USB_TXCSRL13_ERROR           0x00000004 // Error
#define USB_TXCSRL13_FIFONE          0x00000002 // FIFO Not Empty
#define USB_TXCSRL13_TXRDY           0x00000001 // Transmit Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRH13 register.
//*****************************************************************************
#define USB_TXCSRH13_AUTOSET         0x00000080 // Auto Set
#define USB_TXCSRH13_ISO             0x00000040 // Isochronous Transfers
#define USB_TXCSRH13_MODE            0x00000020 // Mode
#define USB_TXCSRH13_DMAEN           0x00000010 // DMA Request Enable
#define USB_TXCSRH13_FDT             0x00000008 // Force Data Toggle
#define USB_TXCSRH13_DMAMOD          0x00000004 // DMA Request Mode
#define USB_TXCSRH13_DTWE            0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH13_DT              0x00000001 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXMAXP13 register.
//*****************************************************************************
#define USB_RXMAXP13_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_RXMAXP13_MAXLOAD_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRL13 register.
//*****************************************************************************
#define USB_RXCSRL13_CLRDT           0x00000080 // Clear Data Toggle
#define USB_RXCSRL13_STALLED         0x00000040 // Endpoint Stalled
#define USB_RXCSRL13_REQPKT          0x00000020 // Request Packet
#define USB_RXCSRL13_STALL           0x00000020 // Send STALL
#define USB_RXCSRL13_FLUSH           0x00000010 // Flush FIFO
#define USB_RXCSRL13_NAKTO           0x00000008 // NAK Timeout
#define USB_RXCSRL13_DATAERR         0x00000008 // Data Error
#define USB_RXCSRL13_OVER            0x00000004 // Overrun
#define USB_RXCSRL13_ERROR           0x00000004 // Error
#define USB_RXCSRL13_FULL            0x00000002 // FIFO Full
#define USB_RXCSRL13_RXRDY           0x00000001 // Receive Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRH13 register.
//*****************************************************************************
#define USB_RXCSRH13_AUTOCL          0x00000080 // Auto Clear
#define USB_RXCSRH13_ISO             0x00000040 // Isochronous Transfers
#define USB_RXCSRH13_AUTORQ          0x00000040 // Auto Request
#define USB_RXCSRH13_DMAEN           0x00000020 // DMA Request Enable
#define USB_RXCSRH13_DISNYET         0x00000010 // Disable NYET
#define USB_RXCSRH13_PIDERR          0x00000010 // PID Error
#define USB_RXCSRH13_DMAMOD          0x00000008 // DMA Request Mode
#define USB_RXCSRH13_DTWE            0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH13_DT              0x00000002 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCOUNT13
// register.
//*****************************************************************************
#define USB_RXCOUNT13_COUNT_M        0x00001FFF // Receive Packet Count
#define USB_RXCOUNT13_COUNT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXTYPE13 register.
//*****************************************************************************
#define USB_TXTYPE13_SPEED_M         0x000000C0 // Operating Speed
#define USB_TXTYPE13_SPEED_DFLT      0x00000000 // Default
#define USB_TXTYPE13_SPEED_FULL      0x00000080 // Full
#define USB_TXTYPE13_SPEED_LOW       0x000000C0 // Low
#define USB_TXTYPE13_PROTO_M         0x00000030 // Protocol
#define USB_TXTYPE13_PROTO_CTRL      0x00000000 // Control
#define USB_TXTYPE13_PROTO_ISOC      0x00000010 // Isochronous
#define USB_TXTYPE13_PROTO_BULK      0x00000020 // Bulk
#define USB_TXTYPE13_PROTO_INT       0x00000030 // Interrupt
#define USB_TXTYPE13_TEP_M           0x0000000F // Target Endpoint Number
#define USB_TXTYPE13_TEP_S           0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXINTERVAL13
// register.
//*****************************************************************************
#define USB_TXINTERVAL13_NAKLMT_M    0x000000FF // NAK Limit
#define USB_TXINTERVAL13_TXPOLL_M    0x000000FF // TX Polling
#define USB_TXINTERVAL13_TXPOLL_S    0
#define USB_TXINTERVAL13_NAKLMT_S    0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXTYPE13 register.
//*****************************************************************************
#define USB_RXTYPE13_SPEED_M         0x000000C0 // Operating Speed
#define USB_RXTYPE13_SPEED_DFLT      0x00000000 // Default
#define USB_RXTYPE13_SPEED_FULL      0x00000080 // Full
#define USB_RXTYPE13_SPEED_LOW       0x000000C0 // Low
#define USB_RXTYPE13_PROTO_M         0x00000030 // Protocol
#define USB_RXTYPE13_PROTO_CTRL      0x00000000 // Control
#define USB_RXTYPE13_PROTO_ISOC      0x00000010 // Isochronous
#define USB_RXTYPE13_PROTO_BULK      0x00000020 // Bulk
#define USB_RXTYPE13_PROTO_INT       0x00000030 // Interrupt
#define USB_RXTYPE13_TEP_M           0x0000000F // Target Endpoint Number
#define USB_RXTYPE13_TEP_S           0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXINTERVAL13
// register.
//*****************************************************************************
#define USB_RXINTERVAL13_TXPOLL_M    0x000000FF // RX Polling
#define USB_RXINTERVAL13_NAKLMT_M    0x000000FF // NAK Limit
#define USB_RXINTERVAL13_TXPOLL_S    0
#define USB_RXINTERVAL13_NAKLMT_S    0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXMAXP14 register.
//*****************************************************************************
#define USB_TXMAXP14_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_TXMAXP14_MAXLOAD_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRL14 register.
//*****************************************************************************
#define USB_TXCSRL14_NAKTO           0x00000080 // NAK Timeout
#define USB_TXCSRL14_CLRDT           0x00000040 // Clear Data Toggle
#define USB_TXCSRL14_STALLED         0x00000020 // Endpoint Stalled
#define USB_TXCSRL14_STALL           0x00000010 // Send STALL
#define USB_TXCSRL14_SETUP           0x00000010 // Setup Packet
#define USB_TXCSRL14_FLUSH           0x00000008 // Flush FIFO
#define USB_TXCSRL14_ERROR           0x00000004 // Error
#define USB_TXCSRL14_UNDRN           0x00000004 // Underrun
#define USB_TXCSRL14_FIFONE          0x00000002 // FIFO Not Empty
#define USB_TXCSRL14_TXRDY           0x00000001 // Transmit Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRH14 register.
//*****************************************************************************
#define USB_TXCSRH14_AUTOSET         0x00000080 // Auto Set
#define USB_TXCSRH14_ISO             0x00000040 // Isochronous Transfers
#define USB_TXCSRH14_MODE            0x00000020 // Mode
#define USB_TXCSRH14_DMAEN           0x00000010 // DMA Request Enable
#define USB_TXCSRH14_FDT             0x00000008 // Force Data Toggle
#define USB_TXCSRH14_DMAMOD          0x00000004 // DMA Request Mode
#define USB_TXCSRH14_DTWE            0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH14_DT              0x00000001 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXMAXP14 register.
//*****************************************************************************
#define USB_RXMAXP14_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_RXMAXP14_MAXLOAD_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRL14 register.
//*****************************************************************************
#define USB_RXCSRL14_CLRDT           0x00000080 // Clear Data Toggle
#define USB_RXCSRL14_STALLED         0x00000040 // Endpoint Stalled
#define USB_RXCSRL14_REQPKT          0x00000020 // Request Packet
#define USB_RXCSRL14_STALL           0x00000020 // Send STALL
#define USB_RXCSRL14_FLUSH           0x00000010 // Flush FIFO
#define USB_RXCSRL14_DATAERR         0x00000008 // Data Error
#define USB_RXCSRL14_NAKTO           0x00000008 // NAK Timeout
#define USB_RXCSRL14_OVER            0x00000004 // Overrun
#define USB_RXCSRL14_ERROR           0x00000004 // Error
#define USB_RXCSRL14_FULL            0x00000002 // FIFO Full
#define USB_RXCSRL14_RXRDY           0x00000001 // Receive Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRH14 register.
//*****************************************************************************
#define USB_RXCSRH14_AUTOCL          0x00000080 // Auto Clear
#define USB_RXCSRH14_AUTORQ          0x00000040 // Auto Request
#define USB_RXCSRH14_ISO             0x00000040 // Isochronous Transfers
#define USB_RXCSRH14_DMAEN           0x00000020 // DMA Request Enable
#define USB_RXCSRH14_PIDERR          0x00000010 // PID Error
#define USB_RXCSRH14_DISNYET         0x00000010 // Disable NYET
#define USB_RXCSRH14_DMAMOD          0x00000008 // DMA Request Mode
#define USB_RXCSRH14_DTWE            0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH14_DT              0x00000002 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCOUNT14
// register.
//*****************************************************************************
#define USB_RXCOUNT14_COUNT_M        0x00001FFF // Receive Packet Count
#define USB_RXCOUNT14_COUNT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXTYPE14 register.
//*****************************************************************************
#define USB_TXTYPE14_SPEED_M         0x000000C0 // Operating Speed
#define USB_TXTYPE14_SPEED_DFLT      0x00000000 // Default
#define USB_TXTYPE14_SPEED_FULL      0x00000080 // Full
#define USB_TXTYPE14_SPEED_LOW       0x000000C0 // Low
#define USB_TXTYPE14_PROTO_M         0x00000030 // Protocol
#define USB_TXTYPE14_PROTO_CTRL      0x00000000 // Control
#define USB_TXTYPE14_PROTO_ISOC      0x00000010 // Isochronous
#define USB_TXTYPE14_PROTO_BULK      0x00000020 // Bulk
#define USB_TXTYPE14_PROTO_INT       0x00000030 // Interrupt
#define USB_TXTYPE14_TEP_M           0x0000000F // Target Endpoint Number
#define USB_TXTYPE14_TEP_S           0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXINTERVAL14
// register.
//*****************************************************************************
#define USB_TXINTERVAL14_TXPOLL_M    0x000000FF // TX Polling
#define USB_TXINTERVAL14_NAKLMT_M    0x000000FF // NAK Limit
#define USB_TXINTERVAL14_TXPOLL_S    0
#define USB_TXINTERVAL14_NAKLMT_S    0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXTYPE14 register.
//*****************************************************************************
#define USB_RXTYPE14_SPEED_M         0x000000C0 // Operating Speed
#define USB_RXTYPE14_SPEED_DFLT      0x00000000 // Default
#define USB_RXTYPE14_SPEED_FULL      0x00000080 // Full
#define USB_RXTYPE14_SPEED_LOW       0x000000C0 // Low
#define USB_RXTYPE14_PROTO_M         0x00000030 // Protocol
#define USB_RXTYPE14_PROTO_CTRL      0x00000000 // Control
#define USB_RXTYPE14_PROTO_ISOC      0x00000010 // Isochronous
#define USB_RXTYPE14_PROTO_BULK      0x00000020 // Bulk
#define USB_RXTYPE14_PROTO_INT       0x00000030 // Interrupt
#define USB_RXTYPE14_TEP_M           0x0000000F // Target Endpoint Number
#define USB_RXTYPE14_TEP_S           0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXINTERVAL14
// register.
//*****************************************************************************
#define USB_RXINTERVAL14_TXPOLL_M    0x000000FF // RX Polling
#define USB_RXINTERVAL14_NAKLMT_M    0x000000FF // NAK Limit
#define USB_RXINTERVAL14_TXPOLL_S    0
#define USB_RXINTERVAL14_NAKLMT_S    0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXMAXP15 register.
//*****************************************************************************
#define USB_TXMAXP15_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_TXMAXP15_MAXLOAD_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRL15 register.
//*****************************************************************************
#define USB_TXCSRL15_NAKTO           0x00000080 // NAK Timeout
#define USB_TXCSRL15_CLRDT           0x00000040 // Clear Data Toggle
#define USB_TXCSRL15_STALLED         0x00000020 // Endpoint Stalled
#define USB_TXCSRL15_SETUP           0x00000010 // Setup Packet
#define USB_TXCSRL15_STALL           0x00000010 // Send STALL
#define USB_TXCSRL15_FLUSH           0x00000008 // Flush FIFO
#define USB_TXCSRL15_UNDRN           0x00000004 // Underrun
#define USB_TXCSRL15_ERROR           0x00000004 // Error
#define USB_TXCSRL15_FIFONE          0x00000002 // FIFO Not Empty
#define USB_TXCSRL15_TXRDY           0x00000001 // Transmit Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXCSRH15 register.
//*****************************************************************************
#define USB_TXCSRH15_AUTOSET         0x00000080 // Auto Set
#define USB_TXCSRH15_ISO             0x00000040 // Isochronous Transfers
#define USB_TXCSRH15_MODE            0x00000020 // Mode
#define USB_TXCSRH15_DMAEN           0x00000010 // DMA Request Enable
#define USB_TXCSRH15_FDT             0x00000008 // Force Data Toggle
#define USB_TXCSRH15_DMAMOD          0x00000004 // DMA Request Mode
#define USB_TXCSRH15_DTWE            0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH15_DT              0x00000001 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXMAXP15 register.
//*****************************************************************************
#define USB_RXMAXP15_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_RXMAXP15_MAXLOAD_S       0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRL15 register.
//*****************************************************************************
#define USB_RXCSRL15_CLRDT           0x00000080 // Clear Data Toggle
#define USB_RXCSRL15_STALLED         0x00000040 // Endpoint Stalled
#define USB_RXCSRL15_STALL           0x00000020 // Send STALL
#define USB_RXCSRL15_REQPKT          0x00000020 // Request Packet
#define USB_RXCSRL15_FLUSH           0x00000010 // Flush FIFO
#define USB_RXCSRL15_DATAERR         0x00000008 // Data Error
#define USB_RXCSRL15_NAKTO           0x00000008 // NAK Timeout
#define USB_RXCSRL15_ERROR           0x00000004 // Error
#define USB_RXCSRL15_OVER            0x00000004 // Overrun
#define USB_RXCSRL15_FULL            0x00000002 // FIFO Full
#define USB_RXCSRL15_RXRDY           0x00000001 // Receive Packet Ready

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCSRH15 register.
//*****************************************************************************
#define USB_RXCSRH15_AUTOCL          0x00000080 // Auto Clear
#define USB_RXCSRH15_AUTORQ          0x00000040 // Auto Request
#define USB_RXCSRH15_ISO             0x00000040 // Isochronous Transfers
#define USB_RXCSRH15_DMAEN           0x00000020 // DMA Request Enable
#define USB_RXCSRH15_PIDERR          0x00000010 // PID Error
#define USB_RXCSRH15_DISNYET         0x00000010 // Disable NYET
#define USB_RXCSRH15_DMAMOD          0x00000008 // DMA Request Mode
#define USB_RXCSRH15_DTWE            0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH15_DT              0x00000002 // Data Toggle

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXCOUNT15
// register.
//*****************************************************************************
#define USB_RXCOUNT15_COUNT_M        0x00001FFF // Receive Packet Count
#define USB_RXCOUNT15_COUNT_S        0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXTYPE15 register.
//*****************************************************************************
#define USB_TXTYPE15_SPEED_M         0x000000C0 // Operating Speed
#define USB_TXTYPE15_SPEED_DFLT      0x00000000 // Default
#define USB_TXTYPE15_SPEED_FULL      0x00000080 // Full
#define USB_TXTYPE15_SPEED_LOW       0x000000C0 // Low
#define USB_TXTYPE15_PROTO_M         0x00000030 // Protocol
#define USB_TXTYPE15_PROTO_CTRL      0x00000000 // Control
#define USB_TXTYPE15_PROTO_ISOC      0x00000010 // Isochronous
#define USB_TXTYPE15_PROTO_BULK      0x00000020 // Bulk
#define USB_TXTYPE15_PROTO_INT       0x00000030 // Interrupt
#define USB_TXTYPE15_TEP_M           0x0000000F // Target Endpoint Number
#define USB_TXTYPE15_TEP_S           0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXINTERVAL15
// register.
//*****************************************************************************
#define USB_TXINTERVAL15_TXPOLL_M    0x000000FF // TX Polling
#define USB_TXINTERVAL15_NAKLMT_M    0x000000FF // NAK Limit
#define USB_TXINTERVAL15_NAKLMT_S    0
#define USB_TXINTERVAL15_TXPOLL_S    0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXTYPE15 register.
//*****************************************************************************
#define USB_RXTYPE15_SPEED_M         0x000000C0 // Operating Speed
#define USB_RXTYPE15_SPEED_DFLT      0x00000000 // Default
#define USB_RXTYPE15_SPEED_FULL      0x00000080 // Full
#define USB_RXTYPE15_SPEED_LOW       0x000000C0 // Low
#define USB_RXTYPE15_PROTO_M         0x00000030 // Protocol
#define USB_RXTYPE15_PROTO_CTRL      0x00000000 // Control
#define USB_RXTYPE15_PROTO_ISOC      0x00000010 // Isochronous
#define USB_RXTYPE15_PROTO_BULK      0x00000020 // Bulk
#define USB_RXTYPE15_PROTO_INT       0x00000030 // Interrupt
#define USB_RXTYPE15_TEP_M           0x0000000F // Target Endpoint Number
#define USB_RXTYPE15_TEP_S           0

