TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_usb.h
//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXINTERVAL15
// register.
//*****************************************************************************
#define USB_RXINTERVAL15_TXPOLL_M    0x000000FF  // RX Polling
#define USB_RXINTERVAL15_NAKLMT_M    0x000000FF // NAK Limit
#define USB_RXINTERVAL15_TXPOLL_S    0
#define USB_RXINTERVAL15_NAKLMT_S    0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT1
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT1_M            0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT1_S            0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT2
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT2_M            0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT2_S            0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT3
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT3_M            0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT3_S            0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT4
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT4_COUNT_M      0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT4_COUNT_S      0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT5
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT5_COUNT_M      0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT5_COUNT_S      0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT6
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT6_COUNT_M      0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT6_COUNT_S      0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT7
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT7_COUNT_M      0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT7_COUNT_S      0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT8
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT8_COUNT_M      0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT8_COUNT_S      0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT9
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT9_COUNT_M      0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT9_COUNT_S      0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT10
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT10_COUNT_M     0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT10_COUNT_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT11
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT11_COUNT_M     0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT11_COUNT_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT12
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT12_COUNT_M     0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT12_COUNT_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT13
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT13_COUNT_M     0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT13_COUNT_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT14
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT14_COUNT_M     0x0000FFFF  // Block Transfer Packet Count
#define USB_RQPKTCOUNT14_COUNT_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT15
// register.
//*****************************************************************************
#define USB_RQPKTCOUNT15_COUNT_M     0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT15_COUNT_S     0

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_RXDPKTBUFDIS
// register.
//*****************************************************************************
#define USB_RXDPKTBUFDIS_EP15        0x00008000 // EP15 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP14        0x00004000 // EP14 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP13        0x00002000 // EP13 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP12        0x00001000 // EP12 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP11        0x00000800 // EP11 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP10        0x00000400 // EP10 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP9         0x00000200 // EP9 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP8         0x00000100 // EP8 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP7         0x00000080 // EP7 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP6         0x00000040 // EP6 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP5         0x00000020 // EP5 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP4         0x00000010 // EP4 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP3         0x00000008 // EP3 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP2         0x00000004 // EP2 RX Double-Packet Buffer
                                                // Disable
#define USB_RXDPKTBUFDIS_EP1         0x00000002 // EP1 RX Double-Packet Buffer
                                                // Disable

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_TXDPKTBUFDIS
// register.
//*****************************************************************************
#define USB_TXDPKTBUFDIS_EP15        0x00008000 // EP15 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP14        0x00004000 // EP14 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP13        0x00002000 // EP13 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP12        0x00001000 // EP12 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP11        0x00000800 // EP11 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP10        0x00000400 // EP10 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP9         0x00000200 // EP9 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP8         0x00000100 // EP8 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP7         0x00000080 // EP7 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP6         0x00000040 // EP6 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP5         0x00000020 // EP5 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP4         0x00000010 // EP4 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP3         0x00000008 // EP3 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP2         0x00000004 // EP2 TX Double-Packet Buffer
                                                // Disable
#define USB_TXDPKTBUFDIS_EP1         0x00000002 // EP1 TX Double-Packet Buffer
                                                // Disable

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_EPC register.
//*****************************************************************************
#define USB_EPC_PFLTACT_M            0x00000300 // Power Fault Action
#define USB_EPC_PFLTACT_UNCHG        0x00000000 // Unchanged
#define USB_EPC_PFLTACT_TRIS         0x00000100 // Tristate
#define USB_EPC_PFLTACT_LOW          0x00000200 // Low
#define USB_EPC_PFLTACT_HIGH         0x00000300 // High
#define USB_EPC_PFLTAEN              0x00000040 // Power Fault Action Enable
#define USB_EPC_PFLTSEN_HIGH         0x00000020 // Power Fault Sense
#define USB_EPC_PFLTEN               0x00000010 // Power Fault Input Enable
#define USB_EPC_EPENDE               0x00000004 // EPEN Drive Enable
#define USB_EPC_EPEN_M               0x00000003 // External Power Supply Enable
                                                // Configuration
#define USB_EPC_EPEN_LOW             0x00000000 // Power Enable Active Low
#define USB_EPC_EPEN_HIGH            0x00000001 // Power Enable Active High
#define USB_EPC_EPEN_VBLOW           0x00000002 // Power Enable High if VBUS
                                                // Low
#define USB_EPC_EPEN_VBHIGH          0x00000003 // Power Enable High if VBUS
                                                // High

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_EPCRIS register.
//*****************************************************************************
#define USB_EPCRIS_PF                0x00000001 // USB Power Fault Interrupt
                                                // Status

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_EPCIM register.
//*****************************************************************************
#define USB_EPCIM_PF                 0x00000001 // USB Power Fault Interrupt
                                                // Mask

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_EPCISC register.
//*****************************************************************************
#define USB_EPCISC_PF                0x00000001 // USB Power Fault Interrupt
                                                // Status and Clear

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_DRRIS register.
//*****************************************************************************
#define USB_DRRIS_RESUME             0x00000001 // RESUME Interrupt Status

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_DRIM register.
//*****************************************************************************
#define USB_DRIM_RESUME              0x00000001 // RESUME Interrupt Mask

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_DRISC register.
//*****************************************************************************
#define USB_DRISC_RESUME             0x00000001 // RESUME Interrupt Status and
                                                // Clear

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_GPCS register.
//*****************************************************************************
#define USB_GPCS_DEVMODOTG           0x00000002 // Enable Device Mode
#define USB_GPCS_DEVMOD              0x00000001 // Device Mode

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_VDC register.
//*****************************************************************************
#define USB_VDC_VBDEN                0x00000001 // VBUS Droop Enable

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_VDCRIS register.
//*****************************************************************************
#define USB_VDCRIS_VD                0x00000001 // VBUS Droop Raw Interrupt
                                                // Status

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_VDCIM register.
//*****************************************************************************
#define USB_VDCIM_VD                 0x00000001 // VBUS Droop Interrupt Mask

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_VDCISC register.
//*****************************************************************************
#define USB_VDCISC_VD                0x00000001 // VBUS Droop Interrupt Status
                                                // and Clear

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_IDVRIS register.
//*****************************************************************************
#define USB_IDVRIS_ID                0x00000001 // ID Valid Detect Raw
                                                // Interrupt Status

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_IDVIM register.
//*****************************************************************************
#define USB_IDVIM_ID                 0x00000001 // ID Valid Detect Interrupt
                                                // Mask

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_IDVISC register.
//*****************************************************************************
#define USB_IDVISC_ID                0x00000001 // ID Valid Detect Interrupt
                                                // Status and Clear

//*****************************************************************************
// The following are defines for the bit fields in the USB_O_DMASEL register.
//*****************************************************************************
#define USB_DMASEL_DMACTX_M          0x00F00000 // DMA C TX Select
#define USB_DMASEL_DMACRX_M          0x000F0000 // DMA C RX Select
#define USB_DMASEL_DMABTX_M          0x0000F000 // DMA B TX Select
#define USB_DMASEL_DMABRX_M          0x00000F00 // DMA B RX Select
#define USB_DMASEL_DMAATX_M          0x000000F0 // DMA A TX Select
#define USB_DMASEL_DMAARX_M          0x0000000F // DMA A RX Select
#define USB_DMASEL_DMABTX_S          12
#define USB_DMASEL_DMABRX_S          8
#define USB_DMASEL_DMAATX_S          4
#define USB_DMASEL_DMAARX_S          0


#endif // __HW_USB_H__



